zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rcc_ex.c
  if (pPeriphClkInit->Div <= 64U)
  {
    RCC->PREDIVxCFGR[xbar_channel] = 0x0;
    RCC->FINDIVxCFGR[xbar_channel] = ((pPeriphClkInit->Div) - 1U) | (1U << 6);
  }
  else if (pPeriphClkInit->Div <= 128U)
  {
    RCC->FINDIVxCFGR[xbar_channel] = ((pPeriphClkInit->Div / 2U) - 1U) | (1U << 6);
    RCC->PREDIVxCFGR[xbar_channel] = 0x1;
  }
  else if (pPeriphClkInit->Div <= 256U)
  {
    RCC->FINDIVxCFGR[xbar_channel] = ((pPeriphClkInit->Div / 4U) - 1U) | (1U << 6);
    RCC->PREDIVxCFGR[xbar_channel] = 0x3;
  }
  else
  {
    RCC->FINDIVxCFGR[xbar_channel] = ((pPeriphClkInit->Div / 1024U) - 1U) | (1U << 6);
    RCC->PREDIVxCFGR[xbar_channel] = 0x3FF;
  }

  p_SRreg = (xbar_channel < 32U) ? &RCC->PREDIVSR1 : &RCC->PREDIVSR2;

  /* Wait for prediv to be ready */
  tickstart = HAL_GetTick();

  while ((*p_SRreg & xbar_channel_msk) != (uint32_t)RESET)
  {
    if ((HAL_GetTick() - tickstart) > PREDIV_TIMEOUT_VALUE)
    {
      return HAL_TIMEOUT;
    }
  }

  p_SRreg = (xbar_channel < 32U) ? &RCC->FINDIVSR1 : &RCC->FINDIVSR2;

  /* Wait for findiv to be ready */
  tickstart = HAL_GetTick();

  while ((*p_SRreg & xbar_channel_msk) != (uint32_t)RESET)
  {
    if ((HAL_GetTick() - tickstart) > FINDIV_TIMEOUT_VALUE)
    {
      return HAL_TIMEOUT;
    }
  }

  LL_RCC_SetCrossbarSource(xbar_channel, pPeriphClkInit->XBAR_ClkSrc);

  /* Wait for xbar to be ready */
  tickstart = HAL_GetTick();

  while ((RCC->XBARxCFGR[xbar_channel] & 0x80U) != (uint32_t)RESET)
  {
    if ((HAL_GetTick() - tickstart) > XBAR_TIMEOUT_VALUE)
    {
      return HAL_TIMEOUT;
    }
  }

#if defined(CORE_CA35)
  if (pPeriphClkInit->XBAR_Channel == RCC_PERIPHCLK_STGEN)
  {
    /* Adapt Systick interrupt period */
    if (HAL_InitTick(TICK_INT_PRIORITY) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }
#endif /* CORE_CA35 */

  return HAL_OK;
}

/**
  * @brief  Get the RCC_ClkInitStruct according to the internal RCC configuration registers.
  * @param  pPeriphClkInit  pointer to an RCC_PeriphCLKInitTypeDef structure that contains
  *         the peripheral id which needs to be a single selection of one the following values:
  *            @arg @ref RCC_PERIPHCLK_LPTIM1_2
  *            @arg @ref RCC_PERIPHCLK_UART2_4
  *            @arg @ref RCC_PERIPHCLK_UART3_5
  *            @arg @ref RCC_PERIPHCLK_SPI2_3
  *            @arg @ref RCC_PERIPHCLK_SPDIFRX
  *            @arg @ref RCC_PERIPHCLK_I2C1_2
  *            @arg @ref RCC_PERIPHCLK_I3C1_2
  *            @arg @ref RCC_PERIPHCLK_I2C3_5
  *            @arg @ref RCC_PERIPHCLK_I3C3
  *            @arg @ref RCC_PERIPHCLK_I2C4_6
  *            @arg @ref RCC_PERIPHCLK_I2C7
  *            @arg @ref RCC_PERIPHCLK_SPI1
  *            @arg @ref RCC_PERIPHCLK_SPI4_5
  *            @arg @ref RCC_PERIPHCLK_SPI6_7
  *            @arg @ref RCC_PERIPHCLK_USART1
  *            @arg @ref RCC_PERIPHCLK_USART6
  *            @arg @ref RCC_PERIPHCLK_UART7_8
  *            @arg @ref RCC_PERIPHCLK_UART9
  *            @arg @ref RCC_PERIPHCLK_SAI1_MDF1
  *            @arg @ref RCC_PERIPHCLK_SAI2
  *            @arg @ref RCC_PERIPHCLK_SAI3_4
  *            @arg @ref RCC_PERIPHCLK_FDCAN
  *            @arg @ref RCC_PERIPHCLK_LTDC
  *            @arg @ref RCC_PERIPHCLK_DSIPHY
  *            @arg @ref RCC_PERIPHCLK_DCMIPP
  *            @arg @ref RCC_PERIPHCLK_CSITXESC
  *            @arg @ref RCC_PERIPHCLK_CSIPHY
  *            @arg @ref RCC_PERIPHCLK_LVDSPHY
  *            @arg @ref RCC_PERIPHCLK_STGEN
  *            @arg @ref RCC_PERIPHCLK_USB3PCIEPHY
  *            @arg @ref RCC_PERIPHCLK_USBTC
  *            @arg @ref RCC_PERIPHCLK_I3C4
  *            @arg @ref RCC_PERIPHCLK_SPI8
  *            @arg @ref RCC_PERIPHCLK_I2C8
  *            @arg @ref RCC_PERIPHCLK_LPUART1
  *            @arg @ref RCC_PERIPHCLK_LPTIM3
  *            @arg @ref RCC_PERIPHCLK_LPTIM4_5
  *            @arg @ref RCC_PERIPHCLK_ADF1
  *            @arg @ref RCC_PERIPHCLK_TSDBG
  *            @arg @ref RCC_PERIPHCLK_TPIU
  *            @arg @ref RCC_PERIPHCLK_ATB
  *            @arg @ref RCC_PERIPHCLK_ADC12
  *            @arg @ref RCC_PERIPHCLK_ADC3
  *            @arg @ref RCC_PERIPHCLK_OSPI1
  *            @arg @ref RCC_PERIPHCLK_OSPI2
  *            @arg @ref RCC_PERIPHCLK_FMC
  *            @arg @ref RCC_PERIPHCLK_SDMMC1
  *            @arg @ref RCC_PERIPHCLK_SDMMC2
  *            @arg @ref RCC_PERIPHCLK_SDMMC3
  *            @arg @ref RCC_PERIPHCLK_ETH1_ETHSW
  *            @arg @ref RCC_PERIPHCLK_ETH2
  *            @arg @ref RCC_PERIPHCLK_ETH1PTP_ETH2PTP
  *            @arg @ref RCC_PERIPHCLK_USB2PHY1
  *            @arg @ref RCC_PERIPHCLK_USB2PHY2
  *            @arg @ref RCC_PERIPHCLK_ICN_M_GPU
  *            @arg @ref RCC_PERIPHCLK_ETHSWREF
  *            @arg @ref RCC_PERIPHCLK_MCO1
  *            @arg @ref RCC_PERIPHCLK_MCO2
  *            @arg @ref RCC_PERIPHCLK_CPU1_EXT2F
  * @retval None
  */
void HAL_RCCEx_GetPeriphCLKConfig(RCC_PeriphCLKInitTypeDef  *pPeriphClkInit)
{
  uint32_t xbar_channel;
  uint32_t config;
  /* Check parameters */

  xbar_channel = pPeriphClkInit->XBAR_Channel;
  config = ((RCC->FINDIVxCFGR[xbar_channel] & RCC_FINDIVxCFGR_FINDIVx_Msk) + 1U) ;
  pPeriphClkInit->Div = config * ((RCC->PREDIVxCFGR[xbar_channel] & RCC_PREDIVxCFGR_PREDIVx_Msk) + 1U);
  pPeriphClkInit->XBAR_ClkSrc = RCC->XBARxCFGR[xbar_channel] & RCC_XBARxCFGR_XBARxSEL_Msk;
}

#if defined(CORE_CA35)
HAL_StatusTypeDef HAL_RCCEx_CA35SS_SetCA35SSClockSource(uint32_t source)
{
  uint32_t tickstart;

  if (source == A35_SOURCE_EXT)
  {
    /* Set A35 source clock to external ck_cpu1_ext2f */
    CA35SSC->CHGCLKREQ_WS1 = CA35SSC_CHGCLKREQ_WS1_ARM_CHGCLKREQ;
  }
  else
  {
    /* Set A35 source clock to internal PLL */
    CA35SSC->CHGCLKREQ_WC1 = CA35SSC_CHGCLKREQ_WC1_ARM_CHGCLKREQ;
  }

  tickstart = HAL_GetTick();

  /* Wait for mux to get ready */
  while (((CA35SSC->CHGCLKREQ_RW & CA35SSC_CHGCLKREQ_RW_ARM_CHGCLKACK) >> 0x1) != source)
  {
    if ((HAL_GetTick() - tickstart) > CHGCLK_TIMEOUT_VALUE)
    {
      return HAL_TIMEOUT;
    }
  }

