zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rcc_ex.c
  /* Update SystemCoreClock */
  SystemCoreClockUpdate();

  return HAL_OK;
}

HAL_StatusTypeDef HAL_RCCEx_CA35SS_GetCA35SSClockSource(uint32_t *source)
{
  *source = CA35SSC->CHGCLKREQ_RW & CA35SSC_CHGCLKREQ_RW_ARM_CHGCLKREQ;

  return HAL_OK;
}
#endif /* CORE_CA35 */

#if defined(CORE_CA35)
/**
  * @brief  Configures PLL1
  * @param  pll_config: pointer to an RCC_PLLInitTypeDef structure
  *
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RCCEx_CA35SS_PLL1Config(const RCC_PLLInitTypeDef *pll_config)
{
  uint32_t tickstart;
  uint32_t source_value;

  /* Save A35ss source clock configuration */
  HAL_RCCEx_CA35SS_GetCA35SSClockSource(&source_value);

  if ((pll_config->PLLState) == RCC_PLL_ON)
  {
    /* When A35ss source clock is PLL1, */
    if (source_value == A35_SOURCE_PLL1)
    {
      /* switch it to external ck_cpu1_ext2f (during PLL1 reconfiguration) */
      HAL_RCCEx_CA35SS_SetCA35SSClockSource(A35_SOURCE_EXT);
    }

    /* Setup PLL (source) */
    LL_RCC_PLL1_SetSource((pll_config->PLLSource) << RCC_MUXSELCFGR_MUXSEL5_Pos);

    /* Reset PLL1 output clock path */
    CA35SSC->PLL_ENABLE_WC1 = CA35SSC_PLL_ENABLE_WC1_NRESET_SWPLL;

    /* Disable PLL1 */
    CA35SSC->PLL_ENABLE_WC1 = CA35SSC_PLL_ENABLE_WC1_PLL_EN;

    /* Wait for PLL1 to unlock */
    tickstart = HAL_GetTick();

    while ((CA35SSC->PLL_ENABLE_RW & CA35SSC_PLL_ENABLE_RW_LOCKP) == CA35SSC_PLL_ENABLE_RW_LOCKP)
    {
      if ((HAL_GetTick() - tickstart) > PLL1_LOCK_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }

    /* Write PLL1 parameters */
    MODIFY_REG(CA35SSC->PLL_FREQ1_RW, CA35SSC_PLL_FREQ1_RW_REFDIV,
               pll_config->FREFDIV << CA35SSC_PLL_FREQ1_RW_REFDIV_Pos);
    MODIFY_REG(CA35SSC->PLL_FREQ1_RW, CA35SSC_PLL_FREQ1_RW_FBDIV,
               pll_config->FBDIV << CA35SSC_PLL_FREQ1_RW_FBDIV_Pos);
    MODIFY_REG(CA35SSC->PLL_FREQ2_RW, CA35SSC_PLL_FREQ2_RW_POSTDIV1,
               pll_config->POSTDIV1 << CA35SSC_PLL_FREQ2_RW_POSTDIV1_Pos);
    MODIFY_REG(CA35SSC->PLL_FREQ2_RW, CA35SSC_PLL_FREQ2_RW_POSTDIV2,
               pll_config->POSTDIV2 << CA35SSC_PLL_FREQ2_RW_POSTDIV2_Pos);

    /* Enable PLL1 */
    CA35SSC->PLL_ENABLE_WS1 = CA35SSC_PLL_ENABLE_WS1_PLL_EN;

    /* Wait for PLL1 to lock */
    tickstart = HAL_GetTick();

    while ((CA35SSC->PLL_ENABLE_RW & CA35SSC_PLL_ENABLE_RW_LOCKP) != CA35SSC_PLL_ENABLE_RW_LOCKP)
    {
      if ((HAL_GetTick() - tickstart) > PLL1_LOCK_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }

    /* deassert PLL1 reset on PLL1 output clock path */
    CA35SSC->PLL_ENABLE_WS1 = CA35SSC_PLL_ENABLE_WS1_NRESET_SWPLL;

    /* When A35ss source clock was PLL1, */
    if (source_value == A35_SOURCE_PLL1)
    {
      /* set it back to internal PLL */
      HAL_RCCEx_CA35SS_SetCA35SSClockSource(A35_SOURCE_PLL1);
    }
  }
  else /* PLL off */
  {
    /* When A35ss source clock is PLL1, */
    if (source_value == A35_SOURCE_PLL1)
    {
      /* switch it to external ck_cpu1_ext2f */
      HAL_RCCEx_CA35SS_SetCA35SSClockSource(A35_SOURCE_EXT);
    }

    /* Reset PLL1 output clock path */
    CA35SSC->PLL_ENABLE_WC1 = CA35SSC_PLL_ENABLE_WC1_NRESET_SWPLL;

    /* Disable PLL1 */
    CA35SSC->PLL_ENABLE_WC1 = CA35SSC_PLL_ENABLE_WC1_PLL_EN;

    /* Wait for PLL to unlock */
    tickstart = HAL_GetTick();

    while ((CA35SSC->PLL_ENABLE_RW & CA35SSC_PLL_ENABLE_RW_LOCKP) != RESET)
    {
      if ((HAL_GetTick() - tickstart) > PLL1_LOCK_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }
  }

  return HAL_OK;
}
#endif /* CORE_CA35 */

/**
  * @brief  Configures PLL2
  * @param  pll_config: pointer to an RCC_PLLInitTypeDef structure
  *
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RCCEx_PLL2Config(RCC_PLLInitTypeDef *pll_config)
{
  uint32_t tickstart;

  /* Check parameters */

  /* Bypass PLL */
  LL_RCC_PLL2_FOUTPOSTDIV_FREF_Enable();

  /* Setup GFG (source) */
  LL_RCC_PLL2_SetSource((pll_config->PLLSource) << RCC_MUXSELCFGR_MUXSEL6_Pos);

  /* Setup VCO params */
  LL_RCC_PLL2_SetFREFDIV(pll_config->FREFDIV);
  LL_RCC_PLL2_SetFBDIV(pll_config->FBDIV);

  /* Setup postdiv */
  LL_RCC_PLL2_ConfigFREQDIV_L1(pll_config->POSTDIV1);
  LL_RCC_PLL2_ConfigFREQDIV_L2(pll_config->POSTDIV2);

  /* Setup fractional if requested, SSCG (spread spectrum) if required */

  if ((pll_config->PLLMode & RCC_PLL_SPREAD_SPECTRUM) == RCC_PLL_SPREAD_SPECTRUM)
  {
    LL_RCC_PLL2_ConfigCSG(pll_config->SSM_DIVVAL, pll_config->SSM_SPREAD);
    LL_RCC_PLL2_CSG_Enable();
    LL_RCC_PLL2_DSMEN_Disable();

    if (pll_config->SSM_Mode == RCC_PLL_CENTERSPREAD)
    {
      CLEAR_BIT(RCC->PLL2CFGR3, RCC_PLL2CFGR3_DOWNSPREAD);
    }
    else
    {
      SET_BIT(RCC->PLL2CFGR3, RCC_PLL2CFGR3_DOWNSPREAD);
    }
  }

  LL_RCC_PLL2_SetFRACIN(pll_config->FRACIN);

  if (pll_config->FRACIN != 0U)
  {
    LL_RCC_PLL2_CSG_Disable();
    LL_RCC_PLL2_DSMEN_Enable();
  }

  /* Handle state (on/off) - if state is on, wait for lock bit */
  if (pll_config->PLLState == RCC_PLL_ON)
  {
    if (HAL_IS_BIT_CLR(RCC->DDRCPCFGR, RCC_DDRCPCFGR_DDRCPEN))
    {
      /* This clock needs to be enabled to allow the PLL to lock */
      CLEAR_BIT(RCC->DDRCPCFGR, RCC_DDRCPCFGR_DDRCPRST);
      SET_BIT(RCC->DDRCPCFGR, RCC_DDRCPCFGR_DDRCPEN);
    }

    LL_RCC_PLL2_Enable();

    /* Wait for lock */
    tickstart = HAL_GetTick();

    while (LL_RCC_PLL2_IsReady() == (uint32_t)RESET)
    {
      if ((HAL_GetTick() - tickstart) > LOCK_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }

    /* Disable bypass */
    LL_RCC_PLL2_FOUTPOSTDIV_FREF_Disable();

    /* Enable postdiv1 & postdiv2, sscg (release ssmod), frac if PLL ON */
    if ((pll_config->PLLMode & RCC_PLL_SPREAD_SPECTRUM) == RCC_PLL_SPREAD_SPECTRUM)
    {
      LL_RCC_PLL2_CSG_Enable();
      LL_RCC_PLL2_SSMODRST_Release();
    }
    else
    {
      LL_RCC_PLL2_CSG_Disable();
      LL_RCC_PLL2_SSMODRST_Assert();
    }

    LL_RCC_PLL2_FOUTPOSTDIV_Enable();
  }
  else
  {
    if (HAL_IS_BIT_SET(RCC->DDRCPCFGR, RCC_DDRCPCFGR_DDRCPEN))
    {
      CLEAR_BIT(RCC->DDRCPCFGR, RCC_DDRCPCFGR_DDRCPEN);
      SET_BIT(RCC->DDRCPCFGR, RCC_DDRCPCFGR_DDRCPRST);
    }

    LL_RCC_PLL2_Disable();
  }

  return HAL_OK;
}
#if defined(RCC_PLL3CFGR1_PLLEN)
/**
  * @brief  Configures PLL3
  * @param  pll_config: pointer to an RCC_PLLInitTypeDef structure
  *
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RCCEx_PLL3Config(RCC_PLLInitTypeDef *pll_config)
{
  uint32_t tickstart;

  /* Check parameters */

  /* Bypass PLL */
  LL_RCC_PLL3_FOUTPOSTDIV_FREF_Enable();

  /* Setup GFG (source) */
  LL_RCC_PLL3_SetSource((pll_config->PLLSource) << RCC_MUXSELCFGR_MUXSEL7_Pos);

  /* Setup VCO params */
  LL_RCC_PLL3_SetFREFDIV(pll_config->FREFDIV);
  LL_RCC_PLL3_SetFBDIV(pll_config->FBDIV);

  /* Setup postdiv */
  LL_RCC_PLL3_ConfigFREQDIV_L1(pll_config->POSTDIV1);
  LL_RCC_PLL3_ConfigFREQDIV_L2(pll_config->POSTDIV2);

  /* Setup fractional if requested, SSCG (spread spectrum) if required */

  if ((pll_config->PLLMode & RCC_PLL_SPREAD_SPECTRUM) == RCC_PLL_SPREAD_SPECTRUM)
  {
    LL_RCC_PLL3_ConfigCSG(pll_config->SSM_DIVVAL, pll_config->SSM_SPREAD);
    LL_RCC_PLL3_CSG_Enable();
    LL_RCC_PLL3_DSMEN_Disable();

    if (pll_config->SSM_Mode == RCC_PLL_CENTERSPREAD)
    {
      CLEAR_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_DOWNSPREAD);
    }
    else
    {
      SET_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_DOWNSPREAD);
    }
  }

