zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rcc_ex.c
  LL_RCC_PLL3_SetFRACIN(pll_config->FRACIN);

  if (pll_config->FRACIN != 0U)
  {
    LL_RCC_PLL3_CSG_Disable();
    LL_RCC_PLL3_DSMEN_Enable();
  }

  /* Handle state (on/off) - if state is on, wait for lock bit */
  if (pll_config->PLLState == RCC_PLL_ON)
  {
    LL_RCC_PLL3_Enable();

    /* Wait for lock */
    tickstart = HAL_GetTick();

    while (LL_RCC_PLL3_IsReady() == (uint32_t)RESET)
    {
      if ((HAL_GetTick() - tickstart) > LOCK_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }

    /* Disable bypass */
    LL_RCC_PLL3_FOUTPOSTDIV_FREF_Disable();

    /* Enable postdiv1 & postdiv2, sscg (release ssmod), frac if PLL ON */
    if ((pll_config->PLLMode & RCC_PLL_SPREAD_SPECTRUM) == RCC_PLL_SPREAD_SPECTRUM)
    {
      LL_RCC_PLL3_CSG_Enable();
      LL_RCC_PLL3_SSMODRST_Release();
    }
    else
    {
      LL_RCC_PLL3_CSG_Disable();
      LL_RCC_PLL3_SSMODRST_Assert();
    }

    LL_RCC_PLL3_FOUTPOSTDIV_Enable();
  }
  else
  {
    LL_RCC_PLL3_Disable();
  }

  return HAL_OK;
}
#endif /* RCC_PLL3CFGR1_PLLEN */
/*
  * @brief  Configures PLL4
  * @param  pll_config: pointer to an RCC_PLLInitTypeDef structure
  *
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RCCEx_PLL4Config(RCC_PLLInitTypeDef *pll_config)
{
  uint32_t tickstart;

  /* Bypass PLL */
  LL_RCC_PLL4_FOUTPOSTDIV_FREF_Enable();

  /* Setup GFG (source) */
  LL_RCC_PLL4_SetSource((pll_config->PLLSource) << RCC_MUXSELCFGR_MUXSEL0_Pos);

  /* Setup VCO params */
  LL_RCC_PLL4_SetFREFDIV(pll_config->FREFDIV);
  LL_RCC_PLL4_SetFBDIV(pll_config->FBDIV);

  /* Setup postdiv */
  LL_RCC_PLL4_ConfigFREQDIV_L1(pll_config->POSTDIV1);
  LL_RCC_PLL4_ConfigFREQDIV_L2(pll_config->POSTDIV2);

  /* Setup fractional if requested, SSCG (spread spectrum) if required */

  if ((pll_config->PLLMode & RCC_PLL_SPREAD_SPECTRUM) == RCC_PLL_SPREAD_SPECTRUM)
  {
    LL_RCC_PLL4_ConfigCSG(pll_config->SSM_DIVVAL, pll_config->SSM_SPREAD);
    LL_RCC_PLL4_CSG_Enable();
    LL_RCC_PLL4_DSMEN_Disable();

    if (pll_config->SSM_Mode == RCC_PLL_CENTERSPREAD)
    {
      CLEAR_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_DOWNSPREAD);
    }
    else
    {
      SET_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_DOWNSPREAD);
    }
  }

  LL_RCC_PLL4_SetFRACIN(pll_config->FRACIN);

  if (pll_config->FRACIN != 0U)
  {
    LL_RCC_PLL4_CSG_Disable();
    LL_RCC_PLL4_DSMEN_Enable();
  }

  /* Handle state (on/off) - if state is on, wait for lock bit */
  if (pll_config->PLLState == RCC_PLL_ON)
  {
    LL_RCC_PLL4_Enable();

    /* Wait for lock */
    tickstart = HAL_GetTick();

    while (LL_RCC_PLL4_IsReady() == (uint32_t)RESET)
    {
      if ((HAL_GetTick() - tickstart) > LOCK_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }

    /* Disable bypass */
    LL_RCC_PLL4_FOUTPOSTDIV_FREF_Disable();

    /* Enable postdiv1 & postdiv2, sscg (release ssmod), frac if PLL ON */
    if ((pll_config->PLLMode & RCC_PLL_SPREAD_SPECTRUM) == RCC_PLL_SPREAD_SPECTRUM)
    {
      LL_RCC_PLL4_CSG_Enable();
      LL_RCC_PLL4_SSMODRST_Release();
    }
    else
    {
      LL_RCC_PLL4_CSG_Disable();
      LL_RCC_PLL4_SSMODRST_Assert();
    }

    LL_RCC_PLL4_FOUTPOSTDIV_Enable();
  }
  else
  {
    LL_RCC_PLL4_Disable();
  }

  return HAL_OK;
}

/**
  * @brief  Configures PLL5
  * @param  pll_config: pointer to an RCC_PLLInitTypeDef structure
  *
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RCCEx_PLL5Config(RCC_PLLInitTypeDef *pll_config)
{
  uint32_t tickstart;

  /* Bypass PLL */
  LL_RCC_PLL5_FOUTPOSTDIV_FREF_Enable();

  /* Setup GFG (source) */
  LL_RCC_PLL5_SetSource((pll_config->PLLSource) << RCC_MUXSELCFGR_MUXSEL1_Pos);

  /* Setup VCO params */
  LL_RCC_PLL5_SetFREFDIV(pll_config->FREFDIV);
  LL_RCC_PLL5_SetFBDIV(pll_config->FBDIV);

  /* Setup postdiv */
  LL_RCC_PLL5_ConfigFREQDIV_L1(pll_config->POSTDIV1);
  LL_RCC_PLL5_ConfigFREQDIV_L2(pll_config->POSTDIV2);

  /* Setup fractionnal if requested, SSCG (spread spectrum) if required */
  if ((pll_config->PLLMode & RCC_PLL_SPREAD_SPECTRUM) == RCC_PLL_SPREAD_SPECTRUM)
  {
    LL_RCC_PLL5_ConfigCSG(pll_config->SSM_DIVVAL, pll_config->SSM_SPREAD);
    LL_RCC_PLL5_CSG_Enable();
    LL_RCC_PLL5_DSMEN_Disable();

    if (pll_config->SSM_Mode == RCC_PLL_CENTERSPREAD)
    {
      CLEAR_BIT(RCC->PLL5CFGR3, RCC_PLL5CFGR3_DOWNSPREAD);
    }
    else
    {
      SET_BIT(RCC->PLL5CFGR3, RCC_PLL5CFGR3_DOWNSPREAD);
    }
  }

  LL_RCC_PLL5_SetFRACIN(pll_config->FRACIN);

  if (pll_config->FRACIN != 0U)
  {
    LL_RCC_PLL5_CSG_Disable();
    LL_RCC_PLL5_DSMEN_Enable();
  }

  /* Handle state (on/off) - if state is on, wait for lock bit */
  if (pll_config->PLLState == RCC_PLL_ON)
  {
    LL_RCC_PLL5_Enable();

    /* Wait for lock */
    tickstart = HAL_GetTick();

    while (LL_RCC_PLL5_IsReady() == (uint32_t)RESET)
    {
      if ((HAL_GetTick() - tickstart) > LOCK_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }

    /* Disable bypass */
    LL_RCC_PLL5_FOUTPOSTDIV_FREF_Disable();

    /* Enable postdiv1 & postdiv2, sscg (release ssmod), frac if PLL ON */
    if ((pll_config->PLLMode & RCC_PLL_SPREAD_SPECTRUM) == RCC_PLL_SPREAD_SPECTRUM)
    {
      LL_RCC_PLL5_CSG_Enable();
      LL_RCC_PLL5_SSMODRST_Release();
    }
    else
    {
      LL_RCC_PLL5_CSG_Disable();
      LL_RCC_PLL5_SSMODRST_Assert();
    }

    LL_RCC_PLL5_FOUTPOSTDIV_Enable();
  }
  else
  {
    LL_RCC_PLL5_Disable();
  }

  return HAL_OK;
}

/**
  * @brief  Configures PLL6
  * @param  pll_config: pointer to an RCC_PLLInitTypeDef structure
  *
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RCCEx_PLL6Config(RCC_PLLInitTypeDef *pll_config)
{
  uint32_t tickstart;

  /* Bypass PLL */
  LL_RCC_PLL6_FOUTPOSTDIV_FREF_Enable();

  /* Setup GFG (source) */
  LL_RCC_PLL6_SetSource((pll_config->PLLSource) << RCC_MUXSELCFGR_MUXSEL2_Pos);

  /* Setup VCO params */
  LL_RCC_PLL6_SetFREFDIV(pll_config->FREFDIV);
  LL_RCC_PLL6_SetFBDIV(pll_config->FBDIV);

  /* Setup postdiv */
  LL_RCC_PLL6_ConfigFREQDIV_L1(pll_config->POSTDIV1);
  LL_RCC_PLL6_ConfigFREQDIV_L2(pll_config->POSTDIV2);

