zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rcc_ex.c
  /* Setup fractionnal if requested, SSCG (spread spectrum) if required */
  if ((pll_config->PLLMode & RCC_PLL_SPREAD_SPECTRUM) == RCC_PLL_SPREAD_SPECTRUM)
  {
    LL_RCC_PLL6_ConfigCSG(pll_config->SSM_DIVVAL, pll_config->SSM_SPREAD);
    LL_RCC_PLL6_CSG_Enable();
    LL_RCC_PLL6_DSMEN_Disable();

    if (pll_config->SSM_Mode == RCC_PLL_CENTERSPREAD)
    {
      CLEAR_BIT(RCC->PLL6CFGR3, RCC_PLL6CFGR3_DOWNSPREAD);
    }
    else
    {
      SET_BIT(RCC->PLL6CFGR3, RCC_PLL6CFGR3_DOWNSPREAD);
    }
  }

  LL_RCC_PLL6_SetFRACIN(pll_config->FRACIN);

  if (pll_config->FRACIN != 0U)
  {
    LL_RCC_PLL6_CSG_Disable();
    LL_RCC_PLL6_DSMEN_Enable();
  }

  /* Handle state (on/off) - if state is on, wait for lock bit */
  if (pll_config->PLLState == RCC_PLL_ON)
  {
    LL_RCC_PLL6_Enable();

    /* Wait for lock */
    tickstart = HAL_GetTick();

    while (LL_RCC_PLL6_IsReady() == (uint32_t)RESET)
    {
      if ((HAL_GetTick() - tickstart) > LOCK_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }

    /* Disable bypass */
    LL_RCC_PLL6_FOUTPOSTDIV_FREF_Disable();

    /* Enable postdiv1 & postdiv2, sscg (release ssmod), frac if PLL ON */
    if ((pll_config->PLLMode & RCC_PLL_SPREAD_SPECTRUM) == RCC_PLL_SPREAD_SPECTRUM)
    {
      LL_RCC_PLL6_CSG_Enable();
      LL_RCC_PLL6_SSMODRST_Release();
    }
    else
    {
      LL_RCC_PLL6_CSG_Disable();
      LL_RCC_PLL6_SSMODRST_Assert();
    }

    LL_RCC_PLL6_FOUTPOSTDIV_Enable();
  }
  else
  {
    LL_RCC_PLL6_Disable();
  }
  return HAL_OK;
}

/**
  * @brief  Configures PLL7
  * @param  pll_config: pointer to an RCC_PLLInitTypeDef structure
  *
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RCCEx_PLL7Config(RCC_PLLInitTypeDef *pll_config)
{
  uint32_t tickstart;

  /* Bypass PLL */
  LL_RCC_PLL7_FOUTPOSTDIV_FREF_Enable();

  /* Setup GFG (source) */
  LL_RCC_PLL7_SetSource((pll_config->PLLSource) << RCC_MUXSELCFGR_MUXSEL3_Pos);

  /* Setup VCO params */
  LL_RCC_PLL7_SetFREFDIV(pll_config->FREFDIV);
  LL_RCC_PLL7_SetFBDIV(pll_config->FBDIV);

  /* Setup postdiv */
  LL_RCC_PLL7_ConfigFREQDIV_L1(pll_config->POSTDIV1);
  LL_RCC_PLL7_ConfigFREQDIV_L2(pll_config->POSTDIV2);

  /* Setup fractionnal if requested, SSCG (spread spectrum) if required */
  if ((pll_config->PLLMode & RCC_PLL_SPREAD_SPECTRUM) == RCC_PLL_SPREAD_SPECTRUM)
  {
    LL_RCC_PLL7_ConfigCSG(pll_config->SSM_DIVVAL, pll_config->SSM_SPREAD);
    LL_RCC_PLL7_CSG_Enable();
    LL_RCC_PLL7_DSMEN_Disable();

    if (pll_config->SSM_Mode == RCC_PLL_CENTERSPREAD)
    {
      CLEAR_BIT(RCC->PLL7CFGR3, RCC_PLL7CFGR3_DOWNSPREAD);
    }
    else
    {
      SET_BIT(RCC->PLL7CFGR3, RCC_PLL7CFGR3_DOWNSPREAD);
    }
  }

  LL_RCC_PLL7_SetFRACIN(pll_config->FRACIN);

  if (pll_config->FRACIN != 0U)
  {
    LL_RCC_PLL7_CSG_Disable();
    LL_RCC_PLL7_DSMEN_Enable();
  }

  /* Handle state (on/off) - if state is on, wait for lock bit */
  if (pll_config->PLLState == RCC_PLL_ON)
  {
    LL_RCC_PLL7_Enable();

    /* Wait for lock */
    tickstart = HAL_GetTick();

    while (LL_RCC_PLL7_IsReady() == (uint32_t)RESET)
    {
      if ((HAL_GetTick() - tickstart) > LOCK_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }

    /* Disable bypass */
    LL_RCC_PLL7_FOUTPOSTDIV_FREF_Disable();

    /* Enable postdiv1 & postdiv2, sscg (release ssmod), frac if PLL ON */
    if ((pll_config->PLLMode & RCC_PLL_SPREAD_SPECTRUM) == RCC_PLL_SPREAD_SPECTRUM)
    {
      LL_RCC_PLL7_CSG_Enable();
      LL_RCC_PLL7_SSMODRST_Release();
    }
    else
    {
      LL_RCC_PLL7_CSG_Disable();
      LL_RCC_PLL7_SSMODRST_Assert();
    }

    LL_RCC_PLL7_FOUTPOSTDIV_Enable();
    LL_RCC_PLL7_SSMODRST_Assert();
  }
  else
  {
    LL_RCC_PLL7_Disable();
  }

  return HAL_OK;
}

/**
  * @brief  Configures PLL8
  * @param  pll_config: pointer to an RCC_PLLInitTypeDef structure
  *
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RCCEx_PLL8Config(RCC_PLLInitTypeDef *pll_config)
{
  uint32_t tickstart;

  /* Bypass PLL */
  LL_RCC_PLL8_FOUTPOSTDIV_FREF_Enable();

  /* Setup GFG (source) */
  LL_RCC_PLL8_SetSource((pll_config->PLLSource) << RCC_MUXSELCFGR_MUXSEL4_Pos);

  /* Setup VCO params */
  LL_RCC_PLL8_SetFREFDIV(pll_config->FREFDIV);
  LL_RCC_PLL8_SetFBDIV(pll_config->FBDIV);

  /* Setup postdiv */
  LL_RCC_PLL8_ConfigFREQDIV_L1(pll_config->POSTDIV1);
  LL_RCC_PLL8_ConfigFREQDIV_L2(pll_config->POSTDIV2);

  /* Setup fractionnal if requested, SSCG (spread spectrum) if required */
  if ((pll_config->PLLMode & RCC_PLL_SPREAD_SPECTRUM) == RCC_PLL_SPREAD_SPECTRUM)
  {
    LL_RCC_PLL8_ConfigCSG(pll_config->SSM_DIVVAL, pll_config->SSM_SPREAD);
    LL_RCC_PLL8_CSG_Enable();
    LL_RCC_PLL8_DSMEN_Disable();

    if (pll_config->SSM_Mode == RCC_PLL_CENTERSPREAD)
    {
      CLEAR_BIT(RCC->PLL8CFGR3, RCC_PLL8CFGR3_DOWNSPREAD);
    }
    else
    {
      SET_BIT(RCC->PLL8CFGR3, RCC_PLL8CFGR3_DOWNSPREAD);
    }
  }

  LL_RCC_PLL8_SetFRACIN(pll_config->FRACIN);

  if (pll_config->FRACIN != 0U)
  {
    LL_RCC_PLL8_CSG_Disable();
    LL_RCC_PLL8_DSMEN_Enable();
  }

  /* Handle state (on/off) - if state is on, wait for lock bit */
  if (pll_config->PLLState == RCC_PLL_ON)
  {
    LL_RCC_PLL8_Enable();

    /* Wait for lock */
    tickstart = HAL_GetTick();

    while (LL_RCC_PLL8_IsReady() == (uint32_t)RESET)
    {
      if ((HAL_GetTick() - tickstart) > LOCK_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }

    /* Disable bypass */
    LL_RCC_PLL8_FOUTPOSTDIV_FREF_Disable();

    /* Enable postdiv1 & postdiv2, sscg (release ssmod), frac if PLL ON */
    if ((pll_config->PLLMode & RCC_PLL_SPREAD_SPECTRUM) == RCC_PLL_SPREAD_SPECTRUM)
    {
      LL_RCC_PLL8_CSG_Enable();
      LL_RCC_PLL8_SSMODRST_Release();
    }
    else
    {
      LL_RCC_PLL8_CSG_Disable();
      LL_RCC_PLL8_SSMODRST_Assert();
    }

    LL_RCC_PLL8_FOUTPOSTDIV_Enable();
  }
  else
  {
    LL_RCC_PLL8_Disable();
  }

  return HAL_OK;
}

#if defined(CORE_CA35)
/**
  * @brief  Retrieve the PLL1 configuration settings
  * @param  pll_config: pointer to an RCC_PLLInitTypeDef structure
  *
  * @retval None
  */
void HAL_RCCEx_CA35SS_GetPLL1Config(RCC_PLLInitTypeDef *pll_config)
{
  pll_config->id = 1;
  pll_config->PLLState   = ((CA35SSC->PLL_ENABLE_RW & CA35SSC_PLL_ENABLE_RW_PLL_EN) == \
                            CA35SSC_PLL_ENABLE_RW_PLL_EN ? RCC_PLL_ON : RCC_PLL_OFF);
  pll_config->PLLSource  = (RCC->MUXSELCFGR & RCC_MUXSELCFGR_MUXSEL5_Msk) >> RCC_MUXSELCFGR_MUXSEL5_Pos;
  pll_config->FREFDIV    = (CA35SSC->PLL_FREQ1_RW & CA35SSC_PLL_FREQ1_RW_REFDIV_Msk) >> CA35SSC_PLL_FREQ1_RW_REFDIV_Pos;
  pll_config->FBDIV      = (CA35SSC->PLL_FREQ1_RW & CA35SSC_PLL_FREQ1_RW_FBDIV_Msk) >> CA35SSC_PLL_FREQ1_RW_FBDIV_Pos;
  pll_config->FRACIN     = 0;
  pll_config->POSTDIV1   = (CA35SSC->PLL_FREQ2_RW & CA35SSC_PLL_FREQ2_RW_POSTDIV1_Msk) >> \
                           CA35SSC_PLL_FREQ2_RW_POSTDIV1_Pos;
  pll_config->POSTDIV2   = (CA35SSC->PLL_FREQ2_RW & CA35SSC_PLL_FREQ2_RW_POSTDIV2_Msk) >> \
                           CA35SSC_PLL_FREQ2_RW_POSTDIV2_Pos;
  pll_config->SSM_Mode   = 0;
  pll_config->SSM_SPREAD = 0;
  pll_config->SSM_DIVVAL = 0;
}
#endif /* CORE_CA35 */

/**
  * @brief  Retrieve the PLL2 configuration settings
  * @param  pll_config: pointer to an RCC_PLLInitTypeDef structure
  *
  * @retval None
  */
void HAL_RCCEx_GetPLL2Config(RCC_PLLInitTypeDef  *pll_config)
{
  pll_config->id = 2;
  pll_config->PLLState = (((RCC->PLL2CFGR1 & RCC_PLL2CFGR1_PLLEN) == RCC_PLL2CFGR1_PLLEN) ? RCC_PLL_ON : RCC_PLL_OFF);
  pll_config->PLLSource = (RCC->MUXSELCFGR & RCC_MUXSELCFGR_MUXSEL6_Msk) >> RCC_MUXSELCFGR_MUXSEL6_Pos;
  pll_config->FREFDIV = (uint8_t)((RCC->PLL2CFGR2 & RCC_PLL2CFGR2_FREFDIV_Msk) >> RCC_PLL2CFGR2_FREFDIV_Pos);
  pll_config->FBDIV = (uint16_t)((RCC->PLL2CFGR2 & RCC_PLL2CFGR2_FBDIV_Msk) >> RCC_PLL2CFGR2_FBDIV_Pos);
  pll_config->FRACIN = (RCC->PLL2CFGR3 & RCC_PLL2CFGR3_FRACIN_Msk) >> RCC_PLL2CFGR3_FRACIN_Pos;
  pll_config->POSTDIV1 = (RCC->PLL2CFGR6 & RCC_PLL2CFGR6_POSTDIV1_Msk) >> RCC_PLL2CFGR6_POSTDIV1_Pos;
  pll_config->POSTDIV2 = (RCC->PLL2CFGR7 & RCC_PLL2CFGR7_POSTDIV2_Msk) >> RCC_PLL2CFGR7_POSTDIV2_Pos;
  pll_config->PLLMode = 0;
  if (LL_RCC_PLL2_CSG_IsEnabled() != 0U)
  {
    pll_config->PLLMode |= RCC_PLL_SPREAD_SPECTRUM;
    pll_config->SSM_DIVVAL = (RCC->PLL2CFGR5 & RCC_PLL2CFGR5_DIVVAL_Msk) >> RCC_PLL2CFGR5_DIVVAL_Pos;
    pll_config->SSM_SPREAD = (RCC->PLL2CFGR5 & RCC_PLL2CFGR5_SPREAD_Msk) >> RCC_PLL2CFGR5_SPREAD_Pos;

