zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rcc_ex.c
  }
}
#if defined(RCC_PLL3CFGR1_PLLEN)
/**
  * @brief  Retrieve the PLL3 configuration settings
  * @param  pll_config: pointer to an RCC_PLLInitTypeDef structure
  *
  * @retval None
  */
void HAL_RCCEx_GetPLL3Config(RCC_PLLInitTypeDef  *pll_config)
{
  pll_config->id = 3;
  pll_config->PLLState = (((RCC->PLL3CFGR1 & RCC_PLL3CFGR1_PLLEN) == RCC_PLL3CFGR1_PLLEN) ? RCC_PLL_ON : RCC_PLL_OFF);
  pll_config->PLLSource = (RCC->MUXSELCFGR & RCC_MUXSELCFGR_MUXSEL7_Msk) >> RCC_MUXSELCFGR_MUXSEL7_Pos;
  pll_config->FREFDIV = (uint8_t)((RCC->PLL3CFGR2 & RCC_PLL3CFGR2_FREFDIV_Msk) >> RCC_PLL3CFGR2_FREFDIV_Pos);
  pll_config->FBDIV = (uint16_t)((RCC->PLL3CFGR2 & RCC_PLL3CFGR2_FBDIV_Msk) >> RCC_PLL3CFGR2_FBDIV_Pos);
  pll_config->FRACIN = (RCC->PLL3CFGR3 & RCC_PLL3CFGR3_FRACIN_Msk) >> RCC_PLL3CFGR3_FRACIN_Pos;
  pll_config->POSTDIV1 = (RCC->PLL3CFGR6 & RCC_PLL3CFGR6_POSTDIV1_Msk) >> RCC_PLL3CFGR6_POSTDIV1_Pos;
  pll_config->POSTDIV2 = (RCC->PLL3CFGR7 & RCC_PLL3CFGR7_POSTDIV2_Msk) >> RCC_PLL3CFGR7_POSTDIV2_Pos;
  pll_config->PLLMode = 0;
  if (LL_RCC_PLL3_CSG_IsEnabled() != 0U)
  {
    pll_config->PLLMode |= RCC_PLL_SPREAD_SPECTRUM;
    pll_config->SSM_DIVVAL = (RCC->PLL3CFGR5 & RCC_PLL3CFGR5_DIVVAL_Msk) >> RCC_PLL3CFGR5_DIVVAL_Pos;
    pll_config->SSM_SPREAD = (RCC->PLL3CFGR5 & RCC_PLL3CFGR5_SPREAD_Msk) >> RCC_PLL3CFGR5_SPREAD_Pos;
  }
}
#endif /* RCC_PLL3CFGR1_PLLEN */
/**
  * @brief  Retrieve the PLL4 configuration settings
  * @param  pll_config: pointer to an RCC_PLLInitTypeDef structure
  *
  * @retval None
  */
void HAL_RCCEx_GetPLL4Config(RCC_PLLInitTypeDef  *pll_config)
{
  pll_config->id = 4;
  pll_config->PLLState = (((RCC->PLL4CFGR1 & RCC_PLL4CFGR1_PLLEN) == RCC_PLL4CFGR1_PLLEN) ? RCC_PLL_ON : RCC_PLL_OFF);
  pll_config->PLLSource = (RCC->MUXSELCFGR & RCC_MUXSELCFGR_MUXSEL0_Msk) >> RCC_MUXSELCFGR_MUXSEL0_Pos;
  pll_config->FREFDIV = (uint8_t)((RCC->PLL4CFGR2 & RCC_PLL4CFGR2_FREFDIV_Msk) >> RCC_PLL4CFGR2_FREFDIV_Pos);
  pll_config->FBDIV = (uint16_t)((RCC->PLL4CFGR2 & RCC_PLL4CFGR2_FBDIV_Msk) >> RCC_PLL4CFGR2_FBDIV_Pos);
  pll_config->FRACIN = (RCC->PLL4CFGR3 & RCC_PLL4CFGR3_FRACIN_Msk) >> RCC_PLL4CFGR3_FRACIN_Pos;
  pll_config->POSTDIV1 = (RCC->PLL4CFGR6 & RCC_PLL4CFGR6_POSTDIV1_Msk) >> RCC_PLL4CFGR6_POSTDIV1_Pos;
  pll_config->POSTDIV2 = (RCC->PLL4CFGR7 & RCC_PLL4CFGR7_POSTDIV2_Msk) >> RCC_PLL4CFGR7_POSTDIV2_Pos;
  pll_config->PLLMode = 0;
  if (LL_RCC_PLL4_CSG_IsEnabled() != 0U)
  {
    pll_config->PLLMode |= RCC_PLL_SPREAD_SPECTRUM;
    pll_config->SSM_DIVVAL = (RCC->PLL4CFGR5 & RCC_PLL4CFGR5_DIVVAL_Msk) >> RCC_PLL4CFGR5_DIVVAL_Pos;
    pll_config->SSM_SPREAD = (RCC->PLL4CFGR5 & RCC_PLL4CFGR5_SPREAD_Msk) >> RCC_PLL4CFGR5_SPREAD_Pos;
  }
}

/**
  * @brief  Retrieve the PLL5 configuration settings
  * @param  pll_config: pointer to an RCC_PLLInitTypeDef structure
  *
  * @retval None
  */
void HAL_RCCEx_GetPLL5Config(RCC_PLLInitTypeDef  *pll_config)
{
  pll_config->id = 5;
  pll_config->PLLState = (((RCC->PLL5CFGR1 & RCC_PLL5CFGR1_PLLEN) == RCC_PLL5CFGR1_PLLEN) ? RCC_PLL_ON : RCC_PLL_OFF);
  pll_config->PLLSource = (RCC->MUXSELCFGR & RCC_MUXSELCFGR_MUXSEL1_Msk) >> RCC_MUXSELCFGR_MUXSEL1_Pos;
  pll_config->FREFDIV = (uint8_t)((RCC->PLL5CFGR2 & RCC_PLL5CFGR2_FREFDIV_Msk) >> RCC_PLL5CFGR2_FREFDIV_Pos);
  pll_config->FBDIV = (uint16_t)((RCC->PLL5CFGR2 & RCC_PLL5CFGR2_FBDIV_Msk) >> RCC_PLL5CFGR2_FBDIV_Pos);
  pll_config->FRACIN = (RCC->PLL5CFGR3 & RCC_PLL5CFGR3_FRACIN_Msk) >> RCC_PLL5CFGR3_FRACIN_Pos;
  pll_config->POSTDIV1 = (RCC->PLL5CFGR6 & RCC_PLL5CFGR6_POSTDIV1_Msk) >> RCC_PLL5CFGR6_POSTDIV1_Pos;
  pll_config->POSTDIV2 = (RCC->PLL5CFGR7 & RCC_PLL5CFGR7_POSTDIV2_Msk) >> RCC_PLL5CFGR7_POSTDIV2_Pos;
  pll_config->PLLMode = 0;
  if (LL_RCC_PLL5_CSG_IsEnabled() != 0U)
  {
    pll_config->PLLMode |= RCC_PLL_SPREAD_SPECTRUM;
    pll_config->SSM_DIVVAL = (RCC->PLL5CFGR5 & RCC_PLL5CFGR5_DIVVAL_Msk) >> RCC_PLL5CFGR5_DIVVAL_Pos;
    pll_config->SSM_SPREAD = (RCC->PLL5CFGR5 & RCC_PLL5CFGR5_SPREAD_Msk) >> RCC_PLL5CFGR5_SPREAD_Pos;
  }
}

/**
  * @brief  Retrieve the PLL6 configuration settings
  * @param  pll_config: pointer to an RCC_PLLInitTypeDef structure
  *
  * @retval None
  */
void HAL_RCCEx_GetPLL6Config(RCC_PLLInitTypeDef  *pll_config)
{
  pll_config->id = 6;
  pll_config->PLLState = (((RCC->PLL6CFGR1 & RCC_PLL6CFGR1_PLLEN) == RCC_PLL6CFGR1_PLLEN) ? RCC_PLL_ON : RCC_PLL_OFF);
  pll_config->PLLSource = (RCC->MUXSELCFGR & RCC_MUXSELCFGR_MUXSEL2_Msk) >> RCC_MUXSELCFGR_MUXSEL2_Pos;
  pll_config->FREFDIV = (uint8_t)((RCC->PLL6CFGR2 & RCC_PLL6CFGR2_FREFDIV_Msk) >> RCC_PLL6CFGR2_FREFDIV_Pos);
  pll_config->FBDIV = (uint16_t)((RCC->PLL6CFGR2 & RCC_PLL6CFGR2_FBDIV_Msk) >> RCC_PLL6CFGR2_FBDIV_Pos);
  pll_config->FRACIN = (RCC->PLL6CFGR3 & RCC_PLL6CFGR3_FRACIN_Msk) >> RCC_PLL6CFGR3_FRACIN_Pos;
  pll_config->POSTDIV1 = (RCC->PLL6CFGR6 & RCC_PLL6CFGR6_POSTDIV1_Msk) >> RCC_PLL6CFGR6_POSTDIV1_Pos;
  pll_config->POSTDIV2 = (RCC->PLL6CFGR7 & RCC_PLL6CFGR7_POSTDIV2_Msk) >> RCC_PLL6CFGR7_POSTDIV2_Pos;
  pll_config->PLLMode = 0;
  if (LL_RCC_PLL6_CSG_IsEnabled() != 0U)
  {
    pll_config->PLLMode |= RCC_PLL_SPREAD_SPECTRUM;
    pll_config->SSM_DIVVAL = (RCC->PLL6CFGR5 & RCC_PLL6CFGR5_DIVVAL_Msk) >> RCC_PLL6CFGR5_DIVVAL_Pos;
    pll_config->SSM_SPREAD = (RCC->PLL6CFGR5 & RCC_PLL6CFGR5_SPREAD_Msk) >> RCC_PLL6CFGR5_SPREAD_Pos;
  }
}

/**
  * @brief  Retrieve the PLL7 configuration settings
  * @param  pll_config: pointer to an RCC_PLLInitTypeDef structure
  *
  * @retval None
  */
void HAL_RCCEx_GetPLL7Config(RCC_PLLInitTypeDef  *pll_config)
{
  pll_config->id = 7;
  pll_config->PLLState = (((RCC->PLL7CFGR1 & RCC_PLL7CFGR1_PLLEN) == RCC_PLL7CFGR1_PLLEN) ? RCC_PLL_ON : RCC_PLL_OFF);
  pll_config->PLLSource = (RCC->MUXSELCFGR & RCC_MUXSELCFGR_MUXSEL3_Msk) >> RCC_MUXSELCFGR_MUXSEL3_Pos;
  pll_config->FREFDIV = (uint8_t)((RCC->PLL7CFGR2 & RCC_PLL7CFGR2_FREFDIV_Msk) >> RCC_PLL7CFGR2_FREFDIV_Pos);
  pll_config->FBDIV = (uint16_t)((RCC->PLL7CFGR2 & RCC_PLL7CFGR2_FBDIV_Msk) >> RCC_PLL7CFGR2_FBDIV_Pos);
  pll_config->FRACIN = (RCC->PLL7CFGR3 & RCC_PLL7CFGR3_FRACIN_Msk) >> RCC_PLL7CFGR3_FRACIN_Pos;
  pll_config->POSTDIV1 = (RCC->PLL7CFGR6 & RCC_PLL7CFGR6_POSTDIV1_Msk) >> RCC_PLL7CFGR6_POSTDIV1_Pos;
  pll_config->POSTDIV2 = (RCC->PLL7CFGR7 & RCC_PLL7CFGR7_POSTDIV2_Msk) >> RCC_PLL7CFGR7_POSTDIV2_Pos;
  pll_config->PLLMode = 0;
  if (LL_RCC_PLL7_CSG_IsEnabled() != 0U)
  {
    pll_config->PLLMode |= RCC_PLL_SPREAD_SPECTRUM;
    pll_config->SSM_DIVVAL = (RCC->PLL7CFGR5 & RCC_PLL7CFGR5_DIVVAL_Msk) >> RCC_PLL7CFGR5_DIVVAL_Pos;
    pll_config->SSM_SPREAD = (RCC->PLL7CFGR5 & RCC_PLL7CFGR5_SPREAD_Msk) >> RCC_PLL7CFGR5_SPREAD_Pos;
  }
}

/**
  * @brief  Retrieve the PLL8 configuration settings
  * @param  pll_config: pointer to an RCC_PLLInitTypeDef structure
  *
  * @retval None
  */
void HAL_RCCEx_GetPLL8Config(RCC_PLLInitTypeDef  *pll_config)
{
  pll_config->id = 8;
  pll_config->PLLState = (((RCC->PLL8CFGR1 & RCC_PLL8CFGR1_PLLEN) == RCC_PLL8CFGR1_PLLEN) ? RCC_PLL_ON : RCC_PLL_OFF);
  pll_config->PLLSource = (RCC->MUXSELCFGR & RCC_MUXSELCFGR_MUXSEL4_Msk) >> RCC_MUXSELCFGR_MUXSEL4_Pos;
  pll_config->FREFDIV = (uint8_t)((RCC->PLL8CFGR2 & RCC_PLL8CFGR2_FREFDIV_Msk) >> RCC_PLL8CFGR2_FREFDIV_Pos);
  pll_config->FBDIV = (uint16_t)((RCC->PLL8CFGR2 & RCC_PLL8CFGR2_FBDIV_Msk) >> RCC_PLL8CFGR2_FBDIV_Pos);
  pll_config->FRACIN = (RCC->PLL8CFGR3 & RCC_PLL8CFGR3_FRACIN_Msk) >> RCC_PLL8CFGR3_FRACIN_Pos;
  pll_config->POSTDIV1 = (RCC->PLL8CFGR6 & RCC_PLL8CFGR6_POSTDIV1_Msk) >> RCC_PLL8CFGR6_POSTDIV1_Pos;
  pll_config->POSTDIV2 = (RCC->PLL8CFGR7 & RCC_PLL8CFGR7_POSTDIV2_Msk) >> RCC_PLL8CFGR7_POSTDIV2_Pos;
  pll_config->PLLMode = 0;
  if (LL_RCC_PLL8_CSG_IsEnabled() != 0U)
  {
    pll_config->PLLMode |= RCC_PLL_SPREAD_SPECTRUM;
    pll_config->SSM_DIVVAL = (RCC->PLL8CFGR5 & RCC_PLL8CFGR5_DIVVAL_Msk) >> RCC_PLL8CFGR5_DIVVAL_Pos;
    pll_config->SSM_SPREAD = (RCC->PLL8CFGR5 & RCC_PLL8CFGR5_SPREAD_Msk) >> RCC_PLL8CFGR5_SPREAD_Pos;
  }
}

