zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rcc_ex.c
#if defined(CORE_CA35)
/**
  * @brief  Compute PLL1 frequency set by its registers
  * @retval PLL1 frequency in Hz
  */
uint32_t HAL_RCCEx_CA35SS_GetPLL1ClockFreq(void)
{
  RCC_PLLInitTypeDef pll;

  HAL_RCCEx_CA35SS_GetPLL1Config(&pll);

  return RCCEx_ComputePLLClockFreq(&pll);
}
#endif /* CORE_CA35 */

/**
  * @brief  Compute PLL2 frequency set by its registers
  *
  * @retval PLL2 frequency in Hz
  */
uint32_t HAL_RCCEx_GetPLL2ClockFreq(void)
{
  RCC_PLLInitTypeDef pll;

  HAL_RCCEx_GetPLL2Config(&pll);

  return RCCEx_ComputePLLClockFreq(&pll);
}
#if defined(RCC_PLL3CFGR1_PLLEN)
/**
  * @brief  Compute PLL3 frequency set by its registers
  *
  * @retval PLL3 frequency in Hz
  */
uint32_t HAL_RCCEx_GetPLL3ClockFreq(void)
{
  RCC_PLLInitTypeDef pll;

  HAL_RCCEx_GetPLL3Config(&pll);

  return RCCEx_ComputePLLClockFreq(&pll);
}
#endif /* RCC_PLL3CFGR1_PLLEN */
/**
  * @brief  Compute PLL4 frequency set by its registers
  *
  * @retval PLL4 frequency in Hz
  */
uint32_t HAL_RCCEx_GetPLL4ClockFreq(void)
{
  RCC_PLLInitTypeDef pll;

  HAL_RCCEx_GetPLL4Config(&pll);

  return RCCEx_ComputePLLClockFreq(&pll);
}

/**
  * @brief  Compute PLL5 frequency set by its registers
  *
  * @retval PLL5 frequency in Hz
  */
uint32_t HAL_RCCEx_GetPLL5ClockFreq(void)
{
  RCC_PLLInitTypeDef pll;

  HAL_RCCEx_GetPLL5Config(&pll);

  return RCCEx_ComputePLLClockFreq(&pll);
}

/**
  * @brief  Compute PLL6 frequency set by its registers
  *
  * @retval PLL6 frequency in Hz
  */
uint32_t HAL_RCCEx_GetPLL6ClockFreq(void)
{
  RCC_PLLInitTypeDef pll;

  HAL_RCCEx_GetPLL6Config(&pll);

  return RCCEx_ComputePLLClockFreq(&pll);
}

/**
  * @brief  Compute PLL7 frequency set by its registers
  *
  * @retval PLL7 frequency in Hz
  */
uint32_t HAL_RCCEx_GetPLL7ClockFreq(void)
{
  RCC_PLLInitTypeDef pll;

  HAL_RCCEx_GetPLL7Config(&pll);

  return RCCEx_ComputePLLClockFreq(&pll);
}

/**
  * @brief  Compute PLL8 frequency set by its registers
  *
  * @retval PLL8 frequency in Hz
  */
uint32_t HAL_RCCEx_GetPLL8ClockFreq(void)
{
  RCC_PLLInitTypeDef pll;

  HAL_RCCEx_GetPLL8Config(&pll);

  return RCCEx_ComputePLLClockFreq(&pll);
}

/**
  * @brief  Return the peripheral clock frequency for peripherals
  * @note   Return 0 if peripheral clock identifier not managed by this API
  * @param  PeriphClk  Peripheral clock identifier
  *         This parameter can be one of the following values and needs to be
  *         a single selection of one the following defines:
  *            @arg @ref RCC_PERIPHCLK_LPTIM1_2
  *            @arg @ref RCC_PERIPHCLK_UART2_4
  *            @arg @ref RCC_PERIPHCLK_UART3_5
  *            @arg @ref RCC_PERIPHCLK_SPI2_3
  *            @arg @ref RCC_PERIPHCLK_SPDIFRX
  *            @arg @ref RCC_PERIPHCLK_I2C1_2
  *            @arg @ref RCC_PERIPHCLK_I3C1_2
  *            @arg @ref RCC_PERIPHCLK_I2C3_5
  *            @arg @ref RCC_PERIPHCLK_I3C3
  *            @arg @ref RCC_PERIPHCLK_I2C4_6
  *            @arg @ref RCC_PERIPHCLK_I2C7
  *            @arg @ref RCC_PERIPHCLK_SPI1
  *            @arg @ref RCC_PERIPHCLK_SPI4_5
  *            @arg @ref RCC_PERIPHCLK_SPI6_7
  *            @arg @ref RCC_PERIPHCLK_USART1
  *            @arg @ref RCC_PERIPHCLK_USART6
  *            @arg @ref RCC_PERIPHCLK_UART7_8
  *            @arg @ref RCC_PERIPHCLK_UART9
  *            @arg @ref RCC_PERIPHCLK_SAI1_MDF1
  *            @arg @ref RCC_PERIPHCLK_SAI2
  *            @arg @ref RCC_PERIPHCLK_SAI3_4
  *            @arg @ref RCC_PERIPHCLK_FDCAN
  *            @arg @ref RCC_PERIPHCLK_LTDC
  *            @arg @ref RCC_PERIPHCLK_DSIPHY
  *            @arg @ref RCC_PERIPHCLK_DCMIPP
  *            @arg @ref RCC_PERIPHCLK_CSITXESC
  *            @arg @ref RCC_PERIPHCLK_CSIPHY
  *            @arg @ref RCC_PERIPHCLK_LVDSPHY
  *            @arg @ref RCC_PERIPHCLK_STGEN
  *            @arg @ref RCC_PERIPHCLK_USB3PCIEPHY
  *            @arg @ref RCC_PERIPHCLK_USBTC
  *            @arg @ref RCC_PERIPHCLK_I3C4
  *            @arg @ref RCC_PERIPHCLK_SPI8
  *            @arg @ref RCC_PERIPHCLK_I2C8
  *            @arg @ref RCC_PERIPHCLK_LPUART1
  *            @arg @ref RCC_PERIPHCLK_LPTIM3
  *            @arg @ref RCC_PERIPHCLK_LPTIM4_5
  *            @arg @ref RCC_PERIPHCLK_ADF1
  *            @arg @ref RCC_PERIPHCLK_TSDBG
  *            @arg @ref RCC_PERIPHCLK_TPIU
  *            @arg @ref RCC_PERIPHCLK_ATB
  *            @arg @ref RCC_PERIPHCLK_ADC12
  *            @arg @ref RCC_PERIPHCLK_ADC3
  *            @arg @ref RCC_PERIPHCLK_OSPI1
  *            @arg @ref RCC_PERIPHCLK_OSPI2
  *            @arg @ref RCC_PERIPHCLK_FMC
  *            @arg @ref RCC_PERIPHCLK_SDMMC1
  *            @arg @ref RCC_PERIPHCLK_SDMMC2
  *            @arg @ref RCC_PERIPHCLK_SDMMC3
  *            @arg @ref RCC_PERIPHCLK_ETH1_ETHSW
  *            @arg @ref RCC_PERIPHCLK_ETH2
  *            @arg @ref RCC_PERIPHCLK_ETH1PTP_ETH2PTP
  *            @arg @ref RCC_PERIPHCLK_USB2PHY1
  *            @arg @ref RCC_PERIPHCLK_USB2PHY2
  *            @arg @ref RCC_PERIPHCLK_ICN_M_GPU
  *            @arg @ref RCC_PERIPHCLK_ETHSWREF
  *            @arg @ref RCC_PERIPHCLK_MCO1
  *            @arg @ref RCC_PERIPHCLK_MCO2
  *            @arg @ref RCC_PERIPHCLK_CPU1_EXT2F
  * @retval Frequency in Hz
  */
uint32_t HAL_RCCEx_GetPeriphCLKFreq(uint32_t PeriphClk)
{
  uint32_t xbar_source;
  uint32_t xbar_source_freq;
  uint32_t periph_freq;
  uint32_t config;
  /* Identify xbar source */
  xbar_source = RCC->XBARxCFGR[PeriphClk] & RCC_XBARxCFGR_XBARxSEL_Msk;

  /* Then retrieve the source frequency */
  switch (xbar_source)
  {
    case RCC_XBAR_CLKSRC_PLL4:
      xbar_source_freq = HAL_RCCEx_GetPLL4ClockFreq();
      break;
    case RCC_XBAR_CLKSRC_PLL5:
      xbar_source_freq = HAL_RCCEx_GetPLL5ClockFreq();
      break;
    case RCC_XBAR_CLKSRC_PLL6:
      xbar_source_freq = HAL_RCCEx_GetPLL6ClockFreq();
      break;
    case RCC_XBAR_CLKSRC_PLL7:
      xbar_source_freq = HAL_RCCEx_GetPLL7ClockFreq();
      break;
    case RCC_XBAR_CLKSRC_PLL8:
      xbar_source_freq = HAL_RCCEx_GetPLL8ClockFreq();
      break;
    case RCC_XBAR_CLKSRC_HSI:
    case RCC_XBAR_CLKSRC_HSI_KER:
      xbar_source_freq = HSI_VALUE;
      break;
    case RCC_XBAR_CLKSRC_MSI:
    case RCC_XBAR_CLKSRC_MSI_KER:
#if defined(RCC_BDCR_MSIFREQSEL)
      if (READ_BIT(RCC->BDCR, RCC_BDCR_MSIFREQSEL) == 0U)
      {
        xbar_source_freq = RCC_MSI_4MHZ;
      }
      else
#endif /* RCC_BDCR_MSIFREQSEL */
      {
        xbar_source_freq = RCC_MSI_16MHZ;
      }
      break;
    case RCC_XBAR_CLKSRC_SPDIF:
      xbar_source_freq = 0;
      break;
    case RCC_XBAR_CLKSRC_I2S:
      xbar_source_freq = EXTERNAL_CLOCK_VALUE;
      break;
    case RCC_XBAR_CLKSRC_HSE:
    case RCC_XBAR_CLKSRC_HSE_KER:
      xbar_source_freq = HSE_VALUE;
      break;
    case RCC_XBAR_CLKSRC_LSI:
      xbar_source_freq = LSI_VALUE;
      break;
    case RCC_XBAR_CLKSRC_LSE:
      xbar_source_freq = LSE_VALUE;
      break;
    default:
      xbar_source_freq = 0;
      break;
  }

  /* Then apply the fgen dividers to calculate exact periph frequency */
  config = (((RCC->FINDIVxCFGR[PeriphClk]) & RCC_FINDIVxCFGR_FINDIVx_Msk) + 1U);
  periph_freq = xbar_source_freq / config * ((RCC->PREDIVxCFGR[PeriphClk] & RCC_PREDIVxCFGR_PREDIVx_Msk) + 1U);
  return (periph_freq);
}

/**
  * @brief  Return the timer clock frequency
  * @param  TimerId  Timer clock identifier
  *         This parameter can be one of the following values and needs to be
  *         a single selection of one the following defines:
  *            @arg @ref RCC_PERIPHCLK_TIM1
  *            @arg @ref RCC_PERIPHCLK_TIM2
  *            @arg @ref RCC_PERIPHCLK_TIM3
  *            @arg @ref RCC_PERIPHCLK_TIM4
  *            @arg @ref RCC_PERIPHCLK_TIM5
  *            @arg @ref RCC_PERIPHCLK_TIM6
  *            @arg @ref RCC_PERIPHCLK_TIM7
  *            @arg @ref RCC_PERIPHCLK_TIM8
  *            @arg @ref RCC_PERIPHCLK_TIM10
  *            @arg @ref RCC_PERIPHCLK_TIM11
  *            @arg @ref RCC_PERIPHCLK_TIM12
  *            @arg @ref RCC_PERIPHCLK_TIM13
  *            @arg @ref RCC_PERIPHCLK_TIM14
  *            @arg @ref RCC_PERIPHCLK_TIM15
  *            @arg @ref RCC_PERIPHCLK_TIM16
  *            @arg @ref RCC_PERIPHCLK_TIM17
  *            @arg @ref RCC_PERIPHCLK_TIM20
  * @retval Frequency in Hz
  */
uint32_t HAL_RCCEx_GetTimerCLKFreq(uint32_t TimerId)
{
  uint32_t apbdiv;
  uint32_t timprer;
  uint32_t timfreq;
  uint32_t icn_ls_mcu;

  icn_ls_mcu = HAL_RCC_GetFreq(RCC_CLOCKTYPE_ICN_LS_MCU);

  switch (TimerId)
  {
    case RCC_PERIPHCLK_TIM2:
    case RCC_PERIPHCLK_TIM3:
    case RCC_PERIPHCLK_TIM4:
    case RCC_PERIPHCLK_TIM5:
    case RCC_PERIPHCLK_TIM6:
    case RCC_PERIPHCLK_TIM7:
    case RCC_PERIPHCLK_TIM10:
    case RCC_PERIPHCLK_TIM11:
    case RCC_PERIPHCLK_TIM12:
    case RCC_PERIPHCLK_TIM13:
    case RCC_PERIPHCLK_TIM14:
      apbdiv = LL_RCC_GetAPB1Prescaler();
      timprer = RCC->TIMG1PRER & RCC_TIMG1PRER_TIMG1PRE;
      break;
    case RCC_PERIPHCLK_TIM1:
    case RCC_PERIPHCLK_TIM8:
    case RCC_PERIPHCLK_TIM15:
    case RCC_PERIPHCLK_TIM16:
    case RCC_PERIPHCLK_TIM17:
#if defined(TIM20)
    case RCC_PERIPHCLK_TIM20:
#endif /* TIM20 */
      apbdiv = LL_RCC_GetAPB2Prescaler();
      timprer = RCC->TIMG2PRER & RCC_TIMG2PRER_TIMG2PRE;
      break;
    default:
      apbdiv = 0UL;
      timprer = 0UL;
      break;
  }

  switch (apbdiv)
  {
    case LL_RCC_APB1_DIV_1:
    case LL_RCC_APB1_DIV_2:
      timfreq = icn_ls_mcu;
      break;
    case LL_RCC_APB1_DIV_4:
      if (timprer == 0U)
      {
        timfreq = icn_ls_mcu / 2U;
      }
      else
      {
        timfreq = icn_ls_mcu;
      }
      break;
    case LL_RCC_APB1_DIV_8:
      if (timprer == 0U)
      {
        timfreq = icn_ls_mcu / 4U;
      }
      else
      {
        timfreq = icn_ls_mcu / 2U;
      }
      break;
    case LL_RCC_APB1_DIV_16:
      if (timprer == 0U)
      {
        timfreq = icn_ls_mcu / 8U;
      }
      else
      {
        timfreq = icn_ls_mcu / 4U;
      }
      break;
    default:
      timfreq = 0;
      break;
  }

