zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rcc_ex.c
  return timfreq;
}
#if defined(RCC_D3DCR_D3PERCKSEL)
/**
  * @brief  Set the D3 clock source
  * @param  source: identifier of the requested source among:
  *         RCC_D3SOURCE_MSI
  *         RCC_D3SOURCE_LSI
  *         RCC_D3SOURCE_LSE
  *
  * @retval HAL_OK
  */
HAL_StatusTypeDef HAL_RCCEx_SetD3ClockSource(uint32_t source)
{
  assert_param(IS_RCC_D3_SOURCE(source));

  MODIFY_REG(RCC->D3DCR, RCC_D3DCR_D3PERCKSEL_Msk, source);

  return HAL_OK;
}

/**
  * @brief  Get the D3 clock source
  * @retval Clock source identifier among:
  *         RCC_D3SOURCE_MSI
  *         RCC_D3SOURCE_LSI
  *         RCC_D3SOURCE_LSE
  */
uint32_t HAL_RCCEx_GetD3ClockSource(void)
{
  return (RCC->D3DCR & RCC_D3DCR_D3PERCKSEL_Msk);
}
#endif /** RCC_D3DCR_D3PERCKSEL  **/


#ifdef CORE_CA35
/**
  * @brief  Control the enable boot function when the system exits from STANDBY
  * @param  RCC_BootCx: Boot Core to be enabled (set to 1)
  *         This parameter can be one (or both) of the following values:
  *            @arg RCC_BOOT_C1: CA35 core selection
  *            @arg RCC_BOOT_C2: CM33 core selection
  *
  * @note   Next combinations are possible:
  *           RCC_BOOT_C1   RCC_BOOT_C2  Expected result
  *               0              0       MPU boots, MCU does not boot
  *               0              1       Only MCU boots
  *               1              0       Only MPU boots
  *               1              1       MPU and MCU boot
  *
  * @note   This function is reset when a system reset occurs, but not when the
  *         circuit exits from STANDBY (rst_app reset)
  * @note   This function can only be called by the CA35
  * @retval None
  */
void HAL_RCCEx_EnableBootCore(uint32_t RCC_BootCx)
{
  assert_param(IS_RCC_BOOT_CORE(RCC_BootCx));
  SET_BIT(RCC->STBYBOOTCR, RCC_BootCx);
}

/**
  * @brief  Control the disable boot function when the system exits from STANDBY
  * @param  RCC_BootCx: Boot Core to be disabled (set to 0)
  *         This parameter can be one (or both) of the following values:
  *            @arg RCC_BOOT_C1: CA35 core selection
  *            @arg RCC_BOOT_C2: CM33 core selection
  *
  * @note   Next combinations are possible:
  *           RCC_BOOT_C1   RCC_BOOT_C2  Expected result
  *               0              0       MPU boots, MCU does not boot
  *               0              1       Only MCU boots
  *               1              0       Only MPU boots
  *               1              1       MPU and MCU boot
  *
  * @note   This function is reset when a system reset occurs, but not when the
  *         circuit exits from STANDBY (rst_app reset)
  * @note   This function can only be called by the CA35
  * @retval None
  */
void HAL_RCCEx_DisableBootCore(uint32_t RCC_BootCx)
{
  assert_param(IS_RCC_BOOT_CORE(RCC_BootCx));
  CLEAR_BIT(RCC->STBYBOOTCR, RCC_BootCx);
}

/**
  * @brief  The MCU will be set in HOLD_BOOT when the next MCU core reset occurs
  * @retval None
  */
void HAL_RCCEx_HoldBootMCU(void)
{
  CLEAR_BIT(RCC->CPUBOOTCR, RCC_CPUBOOTCR_BOOT_CPU2);
}

/**
  * @brief  The MCU will not be in HOLD_BOOT mode when the next MCU core reset occurs.
  * @note   If the MCU was in HOLD_BOOT it will cause the MCU to boot.
  * @retval None
  */
void HAL_RCCEx_BootMCU(void)
{
  SET_BIT(RCC->CPUBOOTCR, RCC_CPUBOOTCR_BOOT_CPU2);
}

#endif /* CORE_CA35 */


/** @defgroup RCCEx_Exported_Functions_Group2 Extended Clock management functions
  *  @brief  Extended Clock management functions
  *
@verbatim
 ===============================================================================
                ##### Extended clock management functions  #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to control the
    CSS feature and the frequency measurement service
    Low speed clock output and clock after wake-up from STOP mode.
@endverbatim
  * @{
  */

/**
  * @brief  Measures the requested clock frequency
  * @note   This is a debug service - not to be used at runtime
  *         because the execution time is not easily predictable
  * @param  clk_id is the clock to be measured (see RCCEx FCALC Observation Clock Selection)
  * @param  ref_id is the reference clock (see RCCEx FCALC Reference Clock Selection)
  * @param  freq contains the result of the measurement
  * @retval fstatus
  */
int32_t HAL_RCCEx_MeasureClockFreq(uint32_t clk_id, uint32_t ref_id, uint32_t *freq)
{
  int32_t  fstatus = 0;
  uint32_t freq_meas_complete_flag;
  uint32_t fcalctwc_val;
  uint32_t min_fcalctwc;
  uint32_t regval;
  uint32_t fcalcrefcksel;
  uint32_t fcalcsts_bit;
  uint32_t overflow_flag;
  uint32_t ckintsel;
  uint32_t ckextsel;
  uint32_t fcalcckextsel;
  uint32_t timeout_flag;
  uint64_t timeout_duration;
  uint64_t start_time;
  uint64_t end_time;
  uint64_t current_time;
  uint64_t ckin_freq_val;
  uint32_t ref_freq;
  uint32_t freq_div;
  uint32_t gfg;
  uint32_t muxsel_val;
  uint64_t config;
  uint32_t tmp = 0;
  /* Initialize reference value for STGENR value low register */
  /* (see check that STGEN is running here below) */
  regval = STGENR->CNTCVL;

  /* Initialize output value */
  *freq = 0;

  /* check values of input parameters */
  if ((clk_id > RCC_FCALC_EXTOBSCLK_DSIPHYPLL)
      || (ref_id > RCC_FCALC_PLL8REFCLOCK))
  {
    return 1;
  }

  /* check presence of functional & accessible STGEN */
  /* (mandatory to handle timeout within measurement algorithm) */
  /* Take into account that STGENC is not visible from M33 */
  /* . by assuming it runs at 64MHz on validation platforms and 32MHz on FPGA */
  /* STGEN_VALUE defined in clock.h FPGA BSP */
#if defined(STGEN_VALUE)
#define STGEN_FREQ_IN_HZ STGEN_VALUE
#else
#define STGEN_FREQ_IN_HZ 64000000
#endif /* STGEN_VALUE */
  /* . by checking STGENC clock is enabled and STGENR value low is changing */
  if (0U == (RCC->STGENCFGR & RCC_STGENCFGR_STGENEN))
  {
    return 2;
  }
  else if (regval == STGENR->CNTCVL)
  {
    return 2;
  }
  else
  {
    /*  do nothing  */
  }

  /* Find reference clock frequency */
  gfg = RCC->MUXSELCFGR;
  switch (ref_id)
  {
    case RCC_FCALC_PLL4REFCLOCK:
      muxsel_val = ((gfg & RCC_MUXSELCFGR_MUXSEL0_Msk) >> RCC_MUXSELCFGR_MUXSEL0_Pos);
      break;
    case RCC_FCALC_PLL5REFCLOCK:
      muxsel_val = ((gfg & RCC_MUXSELCFGR_MUXSEL1_Msk) >> RCC_MUXSELCFGR_MUXSEL1_Pos);
      break;
    case RCC_FCALC_PLL6REFCLOCK:
      muxsel_val = ((gfg & RCC_MUXSELCFGR_MUXSEL2_Msk) >> RCC_MUXSELCFGR_MUXSEL2_Pos);
      break;
    case RCC_FCALC_PLL7REFCLOCK:
      muxsel_val = ((gfg & RCC_MUXSELCFGR_MUXSEL3_Msk) >> RCC_MUXSELCFGR_MUXSEL3_Pos);
      break;
    case RCC_FCALC_PLL8REFCLOCK:
      muxsel_val = ((gfg & RCC_MUXSELCFGR_MUXSEL4_Msk) >> RCC_MUXSELCFGR_MUXSEL4_Pos);
      break;
    default:
      tmp = 1UL;
      muxsel_val = 0xFFU;
      break;
  }
  if (tmp == 1UL)
  {
    return 1;
  }
  fcalcrefcksel = ref_id;
  switch (muxsel_val)
  {
    case 0:
      ref_freq = HSI_VALUE;
      break;
    case 1:
      ref_freq = HSE_VALUE;
      break;
    case 2:
      ref_freq = MSI_VALUE;
      break;
    case 3:
      ref_freq = LSI_VALUE;
      break;
    default:
      tmp = 1UL;
      ref_freq = 0;
      break;
  }
  if (tmp == 1UL)
  {
    return 1;
  }

  /* set the CKINTSEL (or CKEXTSEL if FCALCCKEXTSEL bit is set) field in the RCC */
  /* Clock Frequency Calculator and Observation 0 Clock Configuration Register   */
  /* (RCC_FCALCOBS0CFGR) to select the clock frequency calculator input clock    */
  freq_div = 1;
  if (clk_id <= RCC_FCALC_INTOBSCLK_FINDDIV63)
  {
    ckintsel = clk_id;
    ckextsel = 0;
    fcalcckextsel = 0;
  }
  else
  {
    ckintsel = 0;
    ckextsel = clk_id & 0x7U;
    fcalcckextsel = 1;
    if (RCC_FCALC_EXTOBSCLK_PLL1DIV42 == clk_id)
    {
      freq_div = 42;
    }
    else if (RCC_FCALC_EXTOBSCLK_PLL2DIV4 == clk_id)
    {
      freq_div = 4;
    }
#if defined(RCC_PLL3CFGR1_PLLEN)
    else if (RCC_FCALC_EXTOBSCLK_PLL3DIV2 == clk_id)
    {
      freq_div = 2;
    }
#endif /* RCC_PLL3CFGR1_PLLEN */
    else
    {
      /*  do nothing  */
    }
  }

  /* ALGORITHM STARTS HERE. It is the following : */
  /* While there is an overflow in measurement,   */
  /* decrease FCALCTWC value from 15 (65535 cycles) to 1 (3 cycles). */
  freq_meas_complete_flag = 0;
  fcalctwc_val = 0xF;
  min_fcalctwc = 0x1;
  *freq = 0;
  while ((fcalctwc_val >= min_fcalctwc)
         && (freq_meas_complete_flag == 0U))
  {
    /* set the FCALCRSTN bit in the RCC Clock Frequency Calculator and Observation 1
     * clock Configuration Register (RCC_FCALCOBS1CFGR) to enable the clock frequency
     * calculator.
     */
    SET_BIT(RCC->FCALCOBS1CFGR, RCC_FCALCOBS1CFGR_FCALCRSTN);

    /* set the CKINTSEL (or CKEXTSEL if FCALCCKEXTSEL bit is set) field in the RCC
     * Clock Frequency Calculator and Observation 0 Clock Configuration Register
     * (RCC_FCALCOBS0CFGR) to select the clock frequency calculator input clock
     * (i.e. ckin).
     */
    regval = RCC->FCALCOBS0CFGR;
    regval &= ~(RCC_FCALCOBS0CFGR_CKINTSEL_Msk | RCC_FCALCOBS0CFGR_CKEXTSEL_Msk | RCC_FCALCOBS0CFGR_FCALCCKEXTSEL_Msk);
    regval |= ckintsel;
    regval |= ckextsel << RCC_FCALCOBS0CFGR_CKEXTSEL_Pos;
    regval |= fcalcckextsel << RCC_FCALCOBS0CFGR_FCALCCKEXTSEL_Pos;
    WRITE_REG(RCC->FCALCOBS0CFGR, regval);

    /* set the FCALCCKEN field in the RCC Clock Frequency Calculator and Observation 0
     * Clock Configuration Register (RCC_FCALCOBS0CFGR) to enable the selected input
     * clock at the input of clock frequency calculator.
     */
    regval = RCC->FCALCOBS0CFGR;
    regval |= RCC_FCALCOBS0CFGR_FCALCCKEN;
    WRITE_REG(RCC->FCALCOBS0CFGR, regval);

