zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rcc_ex.c
    /* set the FCALCREFCKSEL field in the RCC Clock Frequency Calculator Reference
     * clock Configuration Register (RCC_FCALCREFCFGR) to select the reference clock
     * (i.e. ckref).
     */
    WRITE_REG(RCC->FCALCREFCFGR, fcalcrefcksel);

    /* set the clock frequency time window value via the FCALCTWC field in the RCC Clock
     * Frequency Calculator Control Register 2 (RCC_FCALCCR2)
     */
    regval = RCC->FCALCCR2;
    regval &= ~RCC_FCALCCR2_FCALCTWC_Msk;
    regval |= (fcalctwc_val << RCC_FCALCCR2_FCALCTWC_Pos);
    WRITE_REG(RCC->FCALCCR2, regval);

    /* set the FCALCTYP field to 0x0C in the RCC Clock Frequency Calculator Control
     * Register 2 (RCC_FCALCCR2) to select the frequency value type.
     */
    regval = RCC->FCALCCR2;
    regval |= (0xCUL << RCC_FCALCCR2_FCALCTYP_Pos);
    WRITE_REG(RCC->FCALCCR2, regval);

    /* select the application mode via the FCALCMD field in the RCC Clock Frequency
     * Calculator Control Register 2 (RCC_FCALCCR2).
     */
    regval = RCC->FCALCCR2;
    regval |= RCC_FCALCCR2_FCALCMD;
    WRITE_REG(RCC->FCALCCR2, regval);

    /* set the FCALCRUN bit in the RCC Clock Frequency Calculator Control Register 1
     * (RCC_FCALCCR1).
     */
    WRITE_REG(RCC->FCALCCR1, RCC_FCALCCR1_FCALCRUN);
    __DSB();

    /*!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!*/
    /* WARNING ! To avoid reading 0x80000 as first value for RCC_FCALCSR :  */
    /*!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!*/
    /* C.ICORD : Systick shall not be used as timeout mechanism, because it requires an interrupt */
    /*           USE RATHER A POLLING MECHANISM ON ALWAYS-ON TIMER STGEN */
    /* wait 1ms (to be better tuned later) */
    timeout_duration = (uint64_t)STGEN_FREQ_IN_HZ / 1000U;
    config = (uint64_t)STGENR->CNTCVL;
    start_time = config + ((uint64_t)STGENR->CNTCVU << 32);
    end_time = start_time + timeout_duration;
    current_time = start_time;
    while (current_time < end_time)
    {
      current_time = config + ((uint64_t)STGENR->CNTCVU << 32);
    }

    /* poll the FCALCSTS bit in the RCC Clock Frequency Calculator Status Register
     * (RCC_FCALCSR) until the calculation is done.
     */
    fcalcsts_bit = 0;
    timeout_flag = 0;
    overflow_flag = 0;

    /* Timeout value (in ms) to be tuned according to the longest */
    /* measurement duration (65535 LSI/LSE cycles ~2 seconds)     */
    timeout_duration = 2UL * (uint64_t)STGEN_FREQ_IN_HZ;
    start_time = config + ((uint64_t)STGENR->CNTCVU << 32);
    end_time = start_time + timeout_duration;

    while ((fcalcsts_bit == 0U)
           && (overflow_flag == 0U)
           && (timeout_flag == 0U))
    {
      regval = RCC->FCALCSR;
      fcalcsts_bit = (regval & RCC_FCALCSR_FCALCSTS) >> RCC_FCALCSR_FCALCSTS_Pos;
      /* detect timeout (time expired whereas counter still zero) */
      current_time = config + ((uint64_t)STGENR->CNTCVU << 32);
      if (current_time > end_time)
      {
        timeout_flag = 1;
      }
      /* detect overflow */
      if ((1UL << 16) == (regval & (1UL << 16)))
      {
        overflow_flag = 1;
      }
    }

    /* read the measured value via the FVAL field in the RCC Clock Frequency Calculator
     * Status Register (RCC_FCALCSR). If FVAL[16] is 1 then the measured value is false.
     */
    /* overflow case */
    if (1U == overflow_flag)
    {
      /* set status for next measurement iteration */
      fstatus = 0;
    }
    else if (1U == timeout_flag)
    {
      /* set status for leaving measurement algorithm */
      fstatus = -1;
    }
    else
    {
      if (0U == (regval & 0xFFFFU))
      {
        /* set status for leaving measurement algorithm */
        fstatus = -1;
      }
      else
      {
        /* compute measured frequency */
        ckin_freq_val = (uint64_t)(((uint64_t)regval & 0xFFFFU) - 16U) * (uint64_t)ref_freq;
        uint32_t denom_val = (1UL << (fcalctwc_val + 1U)) + 5U;
        ckin_freq_val /= (uint64_t)denom_val;
        ckin_freq_val *= (uint64_t)freq_div;
        *freq = (uint32_t)ckin_freq_val;
        freq_meas_complete_flag = 1;
        fstatus = 0;
      }
    }

    /* Re-initialization : */
    /* clear the FCALCRUN bit in the RCC Clock Frequency Calculator
     * Control Register 1 (RCC_FCALCCR1)
     */
    WRITE_REG(RCC->FCALCCR1, 0);

    /* clear the FCALCRSTN bit in the RCC Clock Frequency Calculator and Observation 1
     * clock Configuration Register (RCC_FCALCOBS1CFGR) to disable the clock frequency
     * calculator.
     */
    CLEAR_BIT(RCC->FCALCOBS1CFGR, RCC_FCALCOBS1CFGR_FCALCRSTN);

    /* Waiting for status register to be cleared : NOT SPECIFIED */
    timeout_flag = 0;
    /* timeout duration set to 1ms : to be better tuned later if needed */
    timeout_duration = (uint64_t)STGEN_FREQ_IN_HZ / 1000U;
    start_time = config + ((uint64_t)STGENR->CNTCVU << 32);
    end_time = start_time + timeout_duration;
    regval = READ_REG(RCC->FCALCSR);

    while (((regval & 0xffffU) != 0U)
           && (timeout_flag == 0U))
    {
      regval = READ_REG(RCC->FCALCSR);
      /* detect timeout */
      current_time = config + ((uint64_t)STGENR->CNTCVU << 32);
      if (current_time > end_time)
      {
        timeout_flag = 1;
      }
    }

    if (1U == timeout_flag)
    {
      fstatus = -1;
    }

    /* decrease FCALCTWC value */
    fcalctwc_val -= 1U;

    /* check status */
    if (-1 == fstatus)
    {
      break;
    }
  }
  return fstatus;
}
/**
  * @brief  Enable the LSE Clock Security System.
  * @note   Prior to enable the LSE Clock Security System, LSE oscillator is to be enabled
  *         with HAL_RCC_OscConfig() and the LSE oscillator clock is to be selected as RTC
  *         clock with HAL_RCCEx_PeriphCLKConfig().
  * @retval Status
  */
HAL_StatusTypeDef HAL_RCCEx_EnableLSECSS(void)
{
  uint32_t tickstart;
  uint32_t backup_domain;

#if defined(PWR_BDCR1_DBD3P)
  if (HAL_IS_BIT_CLR(PWR->BDCR1, PWR_BDCR1_DBD3P))
#else
  if (HAL_IS_BIT_CLR(PWR->BDCR, PWR_BDCR_DBP))
#endif /* PWR_BDCR1_DBD3P */
  {
    backup_domain = 1;

