zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rcc_ex.c
    /* Enable write access to Backup domain */
#if defined(PWR_BDCR1_DBD3P)
    SET_BIT(PWR->BDCR1, PWR_BDCR1_DBD3P);
#else
    SET_BIT(PWR->BDCR, PWR_BDCR_DBP);
#endif /* PWR_BDCR1_DBD3P */

    /* Wait for Backup domain Write protection disable */
    tickstart = HAL_GetTick();
#if defined(PWR_BDCR1_DBD3P)
    while ((PWR->BDCR1 & PWR_BDCR1_DBD3P) == (uint32_t)RESET)
#else
    while ((PWR->BDCR & PWR_BDCR_DBP) == (uint32_t)RESET)
#endif /* PWR_BDCR1_DBD3P */
    {
      if ((HAL_GetTick() - tickstart) > DBP_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }
  }
  else
  {
    backup_domain = 0;
  }

  LL_RCC_LSE_EnableCSS();

  if (backup_domain == 1U)
  {
#if defined(PWR_BDCR1_DBD3P)
    CLEAR_BIT(PWR->BDCR1, PWR_BDCR1_DBD3P);
#else
    CLEAR_BIT(PWR->BDCR, PWR_BDCR_DBP);
#endif /* PWR_BDCR1_DBD3P */
  }

  return HAL_OK;
}

/**
  * @brief  Disable the LSE Clock Security System.
  * @note   LSE Clock Security System can only be disabled after a LSE failure detection.
  * @retval None
  */
HAL_StatusTypeDef HAL_RCCEx_DisableLSECSS(void)
{
  uint32_t tickstart;
  uint32_t backup_domain;

#if defined(PWR_BDCR1_DBD3P)
  if (HAL_IS_BIT_CLR(PWR->BDCR1, PWR_BDCR1_DBD3P))
#else
  if (HAL_IS_BIT_CLR(PWR->BDCR, PWR_BDCR_DBP))
#endif /* PWR_BDCR1_DBD3P */
  {
    backup_domain = 1;

    /* Enable write access to Backup domain */
#if defined(PWR_BDCR1_DBD3P)
    SET_BIT(PWR->BDCR1, PWR_BDCR1_DBD3P);
#else
    SET_BIT(PWR->BDCR, PWR_BDCR_DBP);
#endif /* PWR_BDCR1_DBD3P */

    /* Wait for Backup domain Write protection disable */
    tickstart = HAL_GetTick();

#if defined(PWR_BDCR1_DBD3P)
    while ((PWR->BDCR1 & PWR_BDCR1_DBD3P) == (uint32_t)RESET)
#else
    while ((PWR->BDCR & PWR_BDCR_DBP) == (uint32_t)RESET)
#endif /* PWR_BDCR1_DBD3P */
    {
      if ((HAL_GetTick() - tickstart) > DBP_TIMEOUT_VALUE)
      {
        return HAL_TIMEOUT;
      }
    }
  }
  else
  {
    backup_domain = 0;
  }

  LL_RCC_LSE_DisableCSS();

  if (backup_domain == 1U)
  {
#if defined(PWR_BDCR1_DBD3P)
    CLEAR_BIT(PWR->BDCR1, PWR_BDCR1_DBD3P);
#else
    CLEAR_BIT(PWR->BDCR, PWR_BDCR_DBP);
#endif /* PWR_BDCR1_DBD3P */
  }

  return HAL_OK;
}

/**
  * @brief  Enable the HSE Clock Security System.
  * @note   Prior to enable the HSE Clock Security System, HSE oscillator is to be enabled
  *         with HAL_RCC_OscConfig() and the HSE oscillator clock is to be selected as RTC
  *         clock with HAL_RCCEx_PeriphCLKConfig().
  * @retval None
  */
void HAL_RCCEx_EnableHSECSS(void)
{
  LL_RCC_HSE_EnableCSS();
}

/**
  * @brief  Configure the clock observer.
  * @note
  * @param  PeriphClk  Peripheral clock identifier
  *         This parameter can be one of the following values and needs to be
  *         a single selection of one the following defines:
  *            @arg @ref RCC_FLEXGEN0
  *            @arg @ref RCC_FLEXGEN1
  *            @arg @ref RCC_FLEXGEN2
  *            @arg @ref RCC_FLEXGEN3
  *            @arg @ref RCC_FLEXGEN4
  *            @arg @ref RCC_FLEXGEN5
  *            @arg @ref RCC_FLEXGEN6
  *            @arg @ref RCC_PERIPHCLK_LPTIM1_2
  *            @arg @ref RCC_PERIPHCLK_UART2_4
  *            @arg @ref RCC_PERIPHCLK_UART3_5
  *            @arg @ref RCC_PERIPHCLK_SPI2_3
  *            @arg @ref RCC_PERIPHCLK_SPDIFRX
  *            @arg @ref RCC_PERIPHCLK_I2C1_2
  *            @arg @ref RCC_PERIPHCLK_I3C1_2
  *            @arg @ref RCC_PERIPHCLK_I2C3_5
  *            @arg @ref RCC_PERIPHCLK_I3C3
  *            @arg @ref RCC_PERIPHCLK_I2C4_6
  *            @arg @ref RCC_PERIPHCLK_I2C7
  *            @arg @ref RCC_PERIPHCLK_SPI1
  *            @arg @ref RCC_PERIPHCLK_SPI4_5
  *            @arg @ref RCC_PERIPHCLK_SPI6_7
  *            @arg @ref RCC_PERIPHCLK_USART1
  *            @arg @ref RCC_PERIPHCLK_USART6
  *            @arg @ref RCC_PERIPHCLK_UART7_8
  *            @arg @ref RCC_PERIPHCLK_UART9
  *            @arg @ref RCC_PERIPHCLK_SAI1_MDF1
  *            @arg @ref RCC_PERIPHCLK_SAI2
  *            @arg @ref RCC_PERIPHCLK_SAI3_4
  *            @arg @ref RCC_PERIPHCLK_FDCAN
  *            @arg @ref RCC_PERIPHCLK_LTDC
  *            @arg @ref RCC_PERIPHCLK_DSIPHY
  *            @arg @ref RCC_PERIPHCLK_DCMIPP
  *            @arg @ref RCC_PERIPHCLK_CSITXESC
  *            @arg @ref RCC_PERIPHCLK_CSIPHY
  *            @arg @ref RCC_PERIPHCLK_LVDSPHY
  *            @arg @ref RCC_PERIPHCLK_STGEN
  *            @arg @ref RCC_PERIPHCLK_USB3PCIEPHY
  *            @arg @ref RCC_PERIPHCLK_USBTC
  *            @arg @ref RCC_PERIPHCLK_I3C4
  *            @arg @ref RCC_PERIPHCLK_SPI8
  *            @arg @ref RCC_PERIPHCLK_I2C8
  *            @arg @ref RCC_PERIPHCLK_LPUART1
  *            @arg @ref RCC_PERIPHCLK_LPTIM3
  *            @arg @ref RCC_PERIPHCLK_LPTIM4_5
  *            @arg @ref RCC_PERIPHCLK_ADF1
  *            @arg @ref RCC_PERIPHCLK_TSDBG
  *            @arg @ref RCC_PERIPHCLK_TPIU
  *            @arg @ref RCC_PERIPHCLK_ATB
  *            @arg @ref RCC_PERIPHCLK_ADC12
  *            @arg @ref RCC_PERIPHCLK_ADC3
  *            @arg @ref RCC_PERIPHCLK_OSPI1
  *            @arg @ref RCC_PERIPHCLK_OSPI2
  *            @arg @ref RCC_PERIPHCLK_FMC
  *            @arg @ref RCC_PERIPHCLK_SDMMC1
  *            @arg @ref RCC_PERIPHCLK_SDMMC2
  *            @arg @ref RCC_PERIPHCLK_SDMMC3
  *            @arg @ref RCC_PERIPHCLK_ETH1_ETHSW
  *            @arg @ref RCC_PERIPHCLK_ETH2
  *            @arg @ref RCC_PERIPHCLK_ETH1PTP_ETH2PTP
  *            @arg @ref RCC_PERIPHCLK_USB2PHY1
  *            @arg @ref RCC_PERIPHCLK_USB2PHY2
  *            @arg @ref RCC_PERIPHCLK_ICN_M_GPU
  *            @arg @ref RCC_PERIPHCLK_ETHSWREF
  *            @arg @ref RCC_PERIPHCLK_MCO1
  *            @arg @ref RCC_PERIPHCLK_MCO2
  *            @arg @ref RCC_PERIPHCLK_CPU1_EXT2F
  * @param     OBSConf Structure describing the clock observer resource:
  *            - Enable: RCC_CLOCKOBS_ON or RCC_CLOCKOBS_OFF
  *            - ObsType: RCC_FLEXGEN_OBS or RCC_OSC_OBS
  *            - ObsInv: RCC_CLOCKOBS_NOT_INV or RCC_CLOCKOBS_INV
  *            - ObsDiv:
  *                 RCC_OBS_DIV1
  *                 RCC_OBS_DIV2
  *                 RCC_OBS_DIV4
  *                 RCC_OBS_DIV8
  *                 RCC_OBS_DIV16
  *                 RCC_OBS_DIV32
  *                 RCC_OBS_DIV64
  *                 RCC_OBS_DIV128
  *            - ClockType: RCC_INTERNAL_OBS or RCC_EXTERNAL_OBS
  *            - RCC_MCOx: parameter defined in HAL_RCC_MCOConfig function
  *            - RCC_MCOSource: parameter defined in HAL_RCC_MCOConfig function
  *            - RCC_MCODiv: : parameter defined in HAL_RCC_MCOConfig function
  * @retval None
  */
void HAL_RCCEx_ConfigureClockObserver(uint32_t PeriphClk, RCC_ObserverTypeDef *OBSConf)
{
  uint32_t tmpreg;
  uint32_t config = PeriphClk;
  /* Asserts can be added here for parameters check */


  /* flexgen outputs */
  /* Build mask in case of flexgen observation */
  if (OBSConf->ObsType == RCC_FLEXGEN_OBS)
  {
    config = (config | 0xC0U);
  }

  if (OBSConf->ClockType == RCC_INTERNAL_OBS)
  {
    tmpreg = (config << RCC_FCALCOBS0CFGR_CKINTSEL_Pos);
  }
  else
  {
    tmpreg = (config << RCC_FCALCOBS0CFGR_CKEXTSEL_Pos);
    tmpreg |= RCC_FCALCOBS0CFGR_CKOBSEXTSEL;
  }

  if (((OBSConf->RCC_MCOx) & RCC_MCO2_INDEX) != RCC_MCO2_INDEX)
  {
    tmpreg |= ((OBSConf->ObsDiv) << RCC_FCALCOBS0CFGR_CKOBSDIV_Pos);
    tmpreg |= ((OBSConf->ObsInv) << RCC_FCALCOBS0CFGR_CKOBSINV_Pos);
    tmpreg |= ((OBSConf->Enable) << RCC_FCALCOBS0CFGR_CKOBSEN_Pos);

    WRITE_REG(RCC->FCALCOBS0CFGR, tmpreg);
  }
  else
  {
    tmpreg |= ((OBSConf->ObsDiv) << RCC_FCALCOBS1CFGR_CKOBSDIV_Pos);
    tmpreg |= ((OBSConf->ObsInv) << RCC_FCALCOBS1CFGR_CKOBSINV_Pos);
    tmpreg |= ((OBSConf->Enable) << RCC_FCALCOBS1CFGR_CKOBSEN_Pos);

    WRITE_REG(RCC->FCALCOBS1CFGR, tmpreg);
  }

