zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rcc_ex.c
  /* Setup the corresponding MCO */
  HAL_RCC_MCOConfig(OBSConf->RCC_MCOx, OBSConf->RCC_MCOSource, OBSConf->RCC_MCODiv);
}

/**
  * @brief Handle the RCC LSE Clock Security System interrupt request.
  * @retval None
  */
void HAL_RCCEx_LSECSS_IRQHandler(void)
{
  if (READ_BIT(RCC->BDCR, RCC_BDCR_LSECSSD) != 0U)
  {
    /* RCC LSE Clock Security System interrupt user callback */
    HAL_RCCEx_LSECSS_Callback();
  }
}

/**
  * @brief  RCCEx LSE Clock Security System interrupt callback.
  * @retval none
  */
__weak void HAL_RCCEx_LSECSS_Callback(void)
{
  /* NOTE : This function should not be modified, when the callback is needed,
            the @ref HAL_RCCEx_LSECSS_Callback should be implemented in the user file
   */
}

/**
  * @}
  */


/** @addtogroup RCCEx_Private_Functions
  * @{
  */
static uint32_t RCCEx_ComputePLLClockFreq(const RCC_PLLInitTypeDef *pll)
{
  uint32_t source_freq;
  uint64_t pll_output;

#if defined(PLL4_VALUE)
  source_freq = PLL4_VALUE;
#else /* PLL4_VALUE */
  switch (pll->PLLSource)
  {
    case RCC_PLLSOURCE_HSI:
      source_freq = HSI_VALUE;
      break;
    case RCC_PLLSOURCE_HSE:
      source_freq = HSE_VALUE;
      break;
    case RCC_PLLSOURCE_MSI:
#if defined(RCC_BDCR_MSIFREQSEL)
      if (READ_BIT(RCC->BDCR, RCC_BDCR_MSIFREQSEL) == 0U)
      {
        source_freq = RCC_MSI_4MHZ;
      }
      else
#endif /* RCC_BDCR_MSIFREQSEL */
      {
        source_freq = RCC_MSI_16MHZ;
      }
      break;
    default:
      source_freq = 0;
      break;
  }
#endif /* PLL4_VALUE */

  /* Compute PLL frequency from PLL parameters according to fractional mode selection */
  /* Note : keep maximum computing precision by doubling integer resolution */
  /*        and process numerator before applying dividers */
  if (0U == pll->FRACIN)
  {
    pll_output = (uint64_t)source_freq * (uint64_t)pll->FBDIV;
  }
  else
  {
    pll_output = (uint64_t)source_freq * (((uint64_t)(1UL << 24) * (uint64_t)pll->FBDIV) + (uint64_t)pll->FRACIN);
    pll_output /= (1UL << 24);
  }
  pll_output /= ((uint64_t)(pll->FREFDIV) * (uint64_t)(pll->POSTDIV1) * (uint64_t)(pll->POSTDIV2));

  return (uint32_t)pll_output;
}

/**
  * @}
  */
/**
  * @}
  */
#endif /* HAL_RCC_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
